{"Cameraman injured after football kick; PM visits flood-hit Queensland – as it happened [2025-04-05T05:02:53Z]": "  5.31am BST    What we learned today, Saturday 5 April    With that, we will wrap today’s blog. We’ll be back first thing tomorrow to bring you all the latest on the campaign trail, which will hopefully have no further injuries. Until then, here are today’s major developments:  Flood victims in western Queensland unable to work due to the deluge will be eligible for a three-month disaster allowance after the commonwealth activated the special payment scheme. Anthony Albanese visited Longreach in Queensland today to meet with victims of the devastating flooding event. He said to those affected by the natural disaster that “we have your back”, adding the emergency event was beyond politics. The prime minister was forced to justify his announcement of a decision to remove the Port of Darwin from Chinese ownership on ABC Radio yesterday evening, hours before the Coalition announced the policy on a visit to the city. Albanese said the Darwin Port could be subject to compulsory acquisition. While in Darwin, Peter Dutton accidentally injured a cameraman when he kicked a football with a “bit too much heat on it”. The cameraman is bandaged and OK.     Updated at 6.02am BST     5.08am BST       Queensland flood response is proof of value of public service, Labor says The minister for employment and workplace relations, Murray Watt, has been in Brisbane today, where he told journalists the government’s response to the flooding events in western Queensland was proof of the importance of public service workers. He was aiming to contrast Labor, which has increased the number of public servants since gaining office, to the Coalition, which has pledged to slash 41,000 jobs. It is yet to disclose where those jobs will be. Watt said:  There’s a view amongst some running in this election that public servants are a waste. They are not a waste at all when you think about the important work that public sector workers do, whether it be recovering from floods or anything else. I think it’s absolutely incredible that we enter this election campaign with Peter Dutton and the Coalition promising to cut 41,000 public servants from right across Australia. We now know that if you break that down state by state, in Queensland alone, Peter Dutton will cut 5,500 public sector jobs from all around our state.     Updated at 5.20am BST     4.52am BST    Time to wind the clocks back    Daylight saving time ends on Sunday at 3am, when clocks move back one hour in New South Wales, Victoria, South Australia, the Australian Capital Territory and Tasmania. For almost 20 million Australians, the end of daylight saving means an extra hour’s sleep. For others in border communities, it means clarity on opening hours and reservation times for customers between states. Read the story here:   Related: Daylight saving is about to end – and businesses on NSW-Queensland border are celebrating      Updated at 4.55am BST     4.23am BST    ‘Confusion and uncertainty’ among public servants over working mandates    Thousands of public servants have been told their employment agreements will not change regardless of who wins the federal election, as a fresh political fight kicked off over potential job cuts, AAP reports. The employment of 185,000 Australian Public Service workers has been in the spotlight since Peter Dutton pledged to cut 41,000 jobs and push workers to return to the office full-time if elected. The Coalition has since softened its work from home policy, with Dutton now declaring his strong support for it and pledging to further reduce the number of public servants who may be affected by return to work mandates. The Community and Public Sector Union said Dutton’s comments on flexible work had caused “confusion and uncertainty” as until now, it was thought all workers would be affected by full-time office requirements. National secretary Melissa Donnelly said flexible arrangements were why a record number of women worked for the federal public service and could be a deciding factor in someone working or not working.   Related: Coalition rethinks its return to work mandates      Updated at 4.32am BST     3.49am BST       Still on China, Albanese is asked whether there is any political concern over the level of Chinese ownership in food production. He says “we welcome foreign investment in Australia where it’s appropriate” but a port has “particular characteristics to it”. But will forcing China out upset the diplomatic relationship? “No,” Albanese replies.  My job is to stand up for the Australian national interest. I’ll continue to do that. But I note that our relationships with China and our economic relationship has improved to the point where we have more than $20bn of exports that have returned. That’s about Australian jobs and Australian interests. Most of our ports and airports are in private hands. The question is - is it in the hands of Australian national interests? One of the things about superannuation funds which own substantial assets in our ports and our airports … is that superannuation funds mean that all of you who have super accounts own those assets as well, and they get returned to Australians … there’s $3tr of money available. A lot of that, at the moment, is going offshore for infrastructure investment. We want that investing here in Australian infrastructure because that produces a return for Australians as well. Thanks very much.  And so concludes the press conference.    Updated at 3.56am BST     3.46am BST       It was rather convenient of the PM to make the announcement on ABC Darwin ahead of Dutton’s visit. Asked why he called the radio station last night, Albanese says “why not?”  I do lots of interviews. I called Triple M yesterday morning, and I called ... ABC Sydney yesterday.  Pressed on whether he was told an announcement was coming via a leak, Albanese says “that’s up to you lot to talk amongst yourselves about what happens”.  I can confirm certainly it didn’t come from anyone here … We’ve made an announcement, but there’s more detail to come as we roll out over the next four weeks … There’s nothing spontaneous about this. We have a political decision that’s been made on the basis of advice … consistent with the position that we’ve had since 2015, that this is an important national economic asset.  Asked if advice has changed over the past two years, he says “the government increasingly understands that we need to increase our economic resilience”. Does that mean the Chinese interest in the Port of Darwin is a national security threat? Albanese says “we, as a government, have made a decision about our economic resilience, consistent with a position that I have put since 2015”.    Updated at 3.48am BST     3.43am BST    Darwin Port could be subject to compulsory acquisition, says PM    There is some back and forth over a timeline on when the Port of Darwin would be removed from Chinese ownership. Landbridge has told SBS that the port is not for sale. Are you prepared to use compulsory acquisition powers? Albanese replies “yes”.  After how long? Why can’t you say the timeframe?  “I’m not putting a timeframe on it,” he continues.  We are a mature government that does things in an orderly way, and we’ll continue to conduct ourselves in that way.     Updated at 3.47am BST     3.41am BST       The head of Landbridge told the Financial Review they hadn’t heard from the government. The prime minister’s earlier statement was that the government had been in contact with the company. A journalist queries this, asking who from the government had been in contact, and on what timeframe? Albanese says “we have consulted” but won’t go into further details as they’re “commercial issues”.  We have engaged with them. And individual companies have reached out about whether a sale could be got … what we’re saying is that we will, if need be, compulsorily acquire.  He is then asked whether he had conversations with China before his announcement, as Peter Dutton indicated in his press conference when he said the Coalition had contacted the Chinese ambassador.  Well, he’s obviously got better connections with the Chinese ambassador. That’s a very strange thing for him to say. I’ll just leave that sitting there. What we have done is engaged very clearly. I have made – if you go back and look at my transcripts since 2015, you will see multiple statements from me about what our position is.  So how much would it cost taxpayers? Albanese says it’s a commercial position and he won’t engage in speculation.    Updated at 5.02am BST     3.38am BST       PM coy over timing for Darwin returning to Australian ownership OK, but why didn’t he first act upon it when elected more than two years ago? Albanese says the government established an inquiry after taking office and had been “engaging” with stakeholders. He says any time he has been asked about the matter since 2015, he has given the same answer. Asked if Labor could “beat or match” Peter Dutton’s commitment for the port to be returned to Australia in six months, Albanese says that’s just “talking on the run”.  I have seen his media release and his media release pretends this has nothing to do with the commonwealth government of which he was a cabinet minister. And then he was the defence minister during this time as well. He did absolutely nothing. What my government did was have an assessment of these issues but, at the same time, we didn’t wait for that. We looked for interest, including through superannuation funds. I want this to go into Australian ownership. But I’d prefer it to be Australian ownership under the private sector. But, if need be, we will purchase as well.  Pressed “by when”, he doesn’t answer.    Updated at 3.41am BST     3.35am BST       On to the Port of Darwin developments, which Albanese was quick to make on ABC Radio yesterday ahead of the Coalition’s formal announcement to bring it back into Australian hands during a press conference this morning.  Why has it taken an election to make some announcements about this?  Albanese says “it hasn’t”, adding Labor opposed to sale when it was made to the Chinese government under the Coalition in 2015.  That was a direct result of the program introduced by the Abbott government in its 2014 budget of asset recycling, which provided an incentive for state and territory governments to flog off our infrastructure assets. In this case, in April of 2016, the commonwealth gave the Northern Territory government of the Country Liberal party - $19.5m. A cash bonus for flogging off the Port of Darwin. When we’ve come to office, we have been engaging – including with Landbridge – with superannuation funds. The Northern Territory government have been in consultation with my departments as well in our government. We’ve had Treasury and Finance looking at this as well. And I foreshadowed on Thursday, as you are aware, a future announcement about the Port of Darwin. We have a clear view, which is that it should be in Australian hands. And Peter Dutton was in the cabinet that sold it.     Updated at 3.37am BST     3.33am BST       Asked if he would be open to extending the disaster payments beyond 13 weeks, Albanese says that is the “allowance” under the existing fund.  That is the standard, that is not a new fund, that is something that happens in terms of disaster-relief. We will continue to engage constructively with the Queensland government and local mayors … We will continue to listen to them on the ground as well.  He says it “takes time” for regional infrastructure funding to be rolled out, adding the electorate of Maranoa where he is appearing received the most projects in funding announced in January this year.  What we have done is make sure that we have been responsible. I remind you that we turned a $78bn deficit into a$22bn Labor surplus. We then turned the next year a deficit that was projected to be over $50bn- we turned that into a surplus in excess of $15bn. And this year, we have almost halved the deficit that was anticipated. So we have been responsible. We’ve improved the budget bottom line by some $207bn. The first government to produce two budget surpluses in a row in two decades.     Updated at 3.35am BST     3.30am BST       Albanese points to the “unprecedented impacts” of flooding across the region.  What role do you think climate change is playing, if any, in exacerbating those impacts?  He replies that you can’t say any single extreme weather event is solely related to climate change, but science indicates they will become more frequent and more intense.  You cannot say any extreme weather event any single event is just because of climate change. What you can do is look at the science and what the science has told us is that there will be more extreme weather events, more frequent and more intense. That is what we have seen play out, not just here in Australia but around the world.     Updated at 3.33am BST     3.28am BST       On to questions. The prime minister is asked rather bluntly by a reporter “why are you here?”, given the electorate is the safest Coalition seat in the country. He replies he wants to be the prime minister “of all Australians”.  I find it astonishing. I read reports saying to only go to marginal seats. One of the things I think has alienates Australians to mainstream political activity is that view. These people are salt of the Earth. The people I have met today, I am so proud to be prime minister of a country that has people like these producing food and raising children like Cooper and Jacob … I want to represent the whole country. That is my job. It is not to always look at a political map.     Updated at 3.32am BST     3.24am BST       The mayor of Longreach, Tony Rayner, appears next, thanking the prime minister for his visit. He acknowledges both the federal and state government have been on the ground since “day one” of the flood disaster.  The announcement today of the $105m for exclusion fencing to get that back up and running will change the economic health of every town in Western Queensland. Those fences are more than just a fence around one property, they are a fence around every community in Western Queensland and what that means [is] economic safety, health and mental health.  We thank you sincerely for that … it is these partnerships with both federal and state government that keep us going.        3.21am BST       Albanese announces funding for flood-affected areas of QLD Albanese formally announces he will agree to the state government’s request for an additional $7m in funding. He also announces $105m from both governments for exclusion fencing.  I also want to make sure there is confidence that it is not going to run out, that it is available and it certainly will be. The other new fund we will establish today is our fine of $105m between our two governments for exclusion fencing. This is absolutely vital to protect the stock which is there with exclusion fencing coming down, from wild dogs and wild pigs potentially as well as increased fodder on the ground. We do have the Disaster Recovery Allowance also available for people who cannot work or cannot find work due to the flood.  He lists a dozen local government areas that can access the allowance.  I wish everyone well during this period. One of the things about our great Australian farmers and people on the land is this is a tough country, but they are tough and resilient people and we want to see them come through this. They make a contribution not just to their local community, but to our nation as well. We are proud and each of every one of them for the work they do contributing to our country and all of Australia stands with them at this time.     Updated at 3.42am BST     3.19am BST    Albanese to Queenslanders affected by flooding: 'we have your back'    Albanese says to those affected by the floods – “we have your back”, adding the emergency event is beyond politics.  The vision coming out of all of western Queensland is indeed truly distressing and there are small communities still inaccessible that we cannot get to it this time and our thoughts are with those people who have been displaced from their homes as well … I have a message for Queenslanders which is we have your back. We are with you, we will provide whatever support necessary. Just as recently when I spent some time with the premier David Crisafulli … there were no politics, I spoke with Premier David Crisafulli yesterday and we are working hand-in-hand making sure support is provided. I also spoke today to David Littleproud. I always try to tell people when I am in their turf, I wish him well as well. He is working hard. We spoke last week in parliament about the impact of this and will continue to engage with him as the local member that has been most affected in the electorate of Maranoa where we are now.       Updated at 4.37am BST     3.17am BST       Anthony Albanese is appearing in Longreach now. He details meeting a family on a farm this morning to see firsthand the devastation that the floods occurred.  To see the power of Mother Nature in knocking over fencing and knocking over poles uprooted from the ground … you see the power of Mother Nature and the force that was there - that weight … For them to welcome us and show us around and speak to us was a great privilege … at the worst of times we see the best of the Australian character. People helping each other, the emergency services personnel, the police, Australian defence force, everyone from the Royal flying Doctor service here in Longreach, volunteers in the SES, and people around Australia who will kick in to provide support for their fellow Australians at what is a very difficult time.     Updated at 3.20am BST     3.06am BST       Reporter Jake Evans has just appeared on ABC News to describe the drop kick that injured a Channel 10 cameraman. Evans was on the scene during the incident, which occurred during a photo opportunity in Darwin.  Scott Morrison in 2022 learned the hard way when he accidentally tackled the child. Peter Dutton tried to one up that today when he punted the ball into the head of Channel 10 cameraman Ghaith Nadir, cracking a joke that ‘there’s your exclusive’ before realising actually, the camera had knocked him pretty hard and knocked his forehead open. Peter Dutton was quick to check that Ghaith was OK – and he was – but a reminder for all of us that politics can be a blood sport.     Updated at 3.10am BST     2.59am BST       When politicians try to play sport … As we wait for the prime minister’s press conference, let’s take a moment to reflect on how playing sports usually ends terribly for political leaders. Peter Dutton’s wayward football kick injuring a cameraman today joins a long history of lore. In 2022, Scott Morrison lived up to his self-applied moniker of “bulldozer” by crashing into a young child while playing football on the campaign trail in Tasmania. The incident was reminiscent of when Boris Johnson, then mayor of London, knocked over a child while playing rugby in Tokyo in 2015. And who could forget the former PM John Howard’s infamous attempt at cricket on a trip to Pakistan in 2005, when he bowled three balls with none making it to the batsman and bouncing on the pitch repeatedly. Cricket is clearly a dangerous sport – Bob Hawke was also forced to wear an eye patch while campaigning after being hit with a perfectly delivered bouncer that the then-Labor PM failed to avoid.    And then there’s Kevin Rudd, who confused Australia while PM with his handball obsession, and near-constant willingness to compete against young children. The lesson? Stick to politics.    Updated at 3.15am BST     2.49am BST       Electoral commission dealing with alleged breaches of political content laws on Rednote The Australian Electoral Commission (AEC) is assessing a number of complaints about alleged breaches of political content laws on the Chinese social media app Rednote, which are related to the federal election. The social media app is being embraced by candidates in electorates with significant Chinese-Australian populations, including the ultra-marginal seats of Bennelong in Sydney and Menzies in Melbourne. As reported by Guardian Australia earlier this week, some candidates are working with prominent Chinese language influencers to bypass a shadow-ban on political campaigning on Rednote, which is designed to focus on lifestyle content. The AEC has issued general guidance to candidates, stressing content shared from their accounts should contain written or spoken authorisation messages. This also applies when content is produced by a third party, such as an influencer, and then shared on their own accounts. Here’s part of the AEC’s statement:  The AEC assesses and, when appropriate, actions referrals made by users of the platforms. The AEC has already received a number of referrals from Australian Rednote users about electoral content for the upcoming federal election. The AEC would welcome engagement with Rednote representatives as part of our efforts towards ensuring political candidates and other relevant entities are running their campaigns according to Australian laws.     Updated at 2.53am BST     2.32am BST    Cameraman hurt by Dutton football kick with 'a bit too much heat on it'    Man down! There has been an injury on the campaign trail in Darwin, outlets are reporting. According to Andrew Tillett at the Australian Financial Review, Channel 10 camera operator Ghaith Nadir cut his head after a “drop punt” by the opposition leader “had a bit too much heat on it” and struck the man’s camera. He has been pictured bandaged up and shaking hands with Peter Dutton, who checked to make sure he was OK.       Dutton and Nadir shake hands at Cazalys Arena in Palmerston, Darwin. Photograph: Mick Tsikas/AAP      Updated at 6.02am BST     2.11am BST       PM touches down in Longreach The prime minister has touched down in Longreach, about 1,000 km north-west of Brisbane, to visit Queenslanders affected by flooding. He headed to a sheep farm to meet Martin and Rebecca Eggerling, a couple that have been hard hit, and is expected to hold a press conference soon. On the agenda will be the extension of a three-month disaster allowance after the commonwealth activated the special payment scheme. We’re also expecting Anthony Albanese to provide a little more detail on the hunt for a buyer for the Port of Darwin he announced yesterday, despite the Chinese-owned company which holds the lease insisting it is not for sale.    Updated at 2.24am BST     1.57am BST       Where’s the hope? Back to Back Barries on week one of the campaign The federal election campaign was barely a week old when Donald Trump rearranged the world trading order. And in Australia, the leaders covered a lot of ground. But in a campaign lacking inspiration, where is the promise of hope? Tony Barry and Barrie Cassidy examine the impact of new tariffs on Australia just four weeks out from the election. They also debate Dutton’s plan to cut public sector workers, and wonder: is it too much to ask for some big ideas? Listen here:   Related: Back to Back Barries: Trump tariffs wreak havoc on week one      Updated at 2.00am BST     1.34am BST       Independent Sophie Scamps launches re-election bid with free concert The independent MP Sophie Scamps has resurrected her 2022 “Election Beats” concert, with Lime Cordiale and Le Shiv set to hit the stage today in the name of democracy. The free community event on Sydney’s northern beaches, expected to attract about 3,000 locals, will formally launch the re-election campaign of Scamps. She said traditional party politics “does not work for future generations”.  Millennials and Gen Zs will make up 40% of voters at this year’s election, and I’m hearing loud and clear they want real action on climate change, on housing affordability, an economy that works for them, and a future they can believe in. The voices of young people are being drowned out in Canberra by the same old vested interests and lobby groups. Politicians need to listen and involve young people in policy decisions, rather than simply talking at them and making decisions that will ultimately create a more unequal future for young people.  Oli Leimbach from Lime Cordiale said the band were playing the gig to “encourage people to vote for Scamps”.  Sure, we care a lot about live music (and so does Sophie), but we’re also ocean lovers, environmentalists, and we stand for equality and integrity. That’s what the Northern Beaches is all about, and that’s why we’re voting for Sophie.     Updated at 1.52am BST     1.21am BST       NT government backs Coalition plan to put Darwin port back in Australian hands The Northern Territory government has backed the Coalition’s announcement to bring the Darwin port back into Australian hands. The acting chief minister, Gerard Maley, who appeared alongside Peter Dutton earlier, said the ball was now in Anthony Albanese’s hands to detail his plans.  Prime minister Albanese has claimed he’ll directly intervene but has provided no details. Territorians need certainty, not vague statements. Should Australians elect a Dutton Coalition government, we will work with them to ensure Darwin port is managed in the best interests of Territorians and the nation.  The Territory’s minister for logistics and infrastructure, Bill Yan, said he had been working “in good faith” with the commonwealth government since late last year but “we still don’t know what their plans are”.  At every stage of this, the CLP have been fighting for Territorians and that will continue under a Dutton Coalition in Canberra.     Updated at 2.06am BST     1.09am BST       Have you been paying attention this week? Myself and Elias Visontay have compiled an election campaign quiz that covers all the gaffes, the gags and the plain weird. Who will win the federal election? We have no idea, but luckily that’s not one of the questions. See how you fare:   Related: The great Australian election campaign quiz – week one      Updated at 1.55am BST     1.00am BST       Albanese and UK’s Starmer discuss response to Trump tariffs Global fallout is continuing over the Trump administration’s sweeping tariffs, including among the US’s major allies. The UK has had the same 10% tariff rate as Australia imposed – the baseline rate being applied to all countries. The ABC reports Anthony Albanese discussed the global response with the UK’s prime minister, Keir Starmer, and efforts to ensure trade barriers don’t continue to escalate. A spokesperson for the PM said he “reaffirmed support for free and fair trade and the need for leaders to ensure that there was not an escalation of trade impediments”, while Starmer’s spokesperson said “an all-out trade war would be extremely damaging and is in nobody’s interests”.    Updated at 1.07am BST     12.48am BST       So where is Dutton heading next? He told reporters at the conclusion of his press conference that there would be a picture opportunity later on today and “maybe a petrol stop”.    Dutton enthusiastically pumped the bowser during a visit to a service station in Carlingford, in Sydney’s north-west, yesterday, but perhaps Darwin’s servos have better lighting for pictures. He also noted the press pack had changed somewhat as we entered the second week of the campaign, telling reporters during his presser that the pace was “too quick” for some.  Welcome to the new faces … Good of you to join us here. Burnt a few others out. Pace is too quick. They’ve taken a rest. Some have been subbed in. Well done.     Updated at 12.56am BST     12.39am BST       If you’re wondering what exactly the Coalition’s work from home policy actually means, it’s understandable to be confused. The shadow finance and public service minister, Jane Hume, introduced the policy on 3 March, stating all public service workers would have to return to the office if the Coalition won government. “Exceptions can and will be made,” she said, “but they will be made where they work for everyone.” Since then, it has been walked back, with Dutton declaring it would only apply to public servants in Canberra. Now, he says “flexibility continues”, and has appeared to indicate existing EBAs that allow staff to work from home would still apply. So if you’re a public servant outside Canberra, or you have the ability to work from home embedded in your enterprise agreement, you would be exempt, which leaves a significantly smaller pool of people to be impacted.    Updated at 12.49am BST     12.30am BST       The last question comes from Andrew Probyn, who you may recall became a TikTok sensation in 2020 when Scott Morrison said he didn’t “run the press conference”.  I know that bashing up the public service is a bit of a political sport and has been for decades, but you have added some complexion to your work-from-home policy. You are saying that it will only affect people who work in Canberra in the public service. Two-thirds of the public service live outside of the ACT, so why is it fair for someone who works for the defence force in Perth, Mr Hastie’s town, that they can work from home, but not from Canberra?  Dutton says the “bulk of the public service is in Canberra”, to which Probyn interjects “a third of the public service”. Dutton:  Under Mr Rudd and Ms Gillard, the public service, from that period until now, under this government, the way they have increased the number of public servants has increased threefold. In Canberra, there are different dynamics around travel and different dynamics in regional parts where public servants are working remotely … Flexibility continues, whether it’s in Canberra or whether it’s outside of Canberra, so the scare campaign that has taken place has been quite disingenuous, misleading and politically based. Our argument is we want the most efficiency for our taxpayers who are working harder than ever under this government. So, people have, I think, a reasonable expectation to know that if their taxpayer dollars are contributing to the public service, that we’re delivering the public service in the most efficient way possible.  And he’s off!    Updated at 12.47am BST     12.26am BST       Dutton is pointed to the fact women with children work in the public service in Canberra.  Yes, but I’ve said we are very happy for flexibility in that workplace as well … we have to make sure that where we have taxpayers’ money being expended on wages for public servants in Canberra that we’re getting the most efficiency for taxpayers out of that investment and I don’t think that’s controversial. For the prime minister to be out there and Jim Chalmers and others trying to scare women in workplaces across the country, I think is a disgrace. I’ve said very clearly that where you’ve got existing arrangements, which happens in Canberra now in the public service, you have EBAs that are there that allow for work from home arrangements, we are not proposing to change those and that’s the reality.     Updated at 12.45am BST     12.24am BST         On to other matters, Dutton is asked about YouGov polling released last night, which painted a dire picture for the Coalition’s plan to force public servants to work in the office. “Will you reconsider your policy?” He accuses the government of “scaring Australians”.  Their response in relation to Medicare, to suggest that we would cut money from hospital funding or Medicare when we are in government, it is a complete lie … Why do they want to scare women when the policy doesn’t affect anybody except for public servants in Canberra.  Two-thirds of public servants live outside Canberra. Dutton continues to talk about Medicare.  I think people who are listening to the Labor party lies at the moment and the scare campaign that is under way, I would say why aren’t they talking about their record, if it’s so good? I think that’s important.  Dutton says he “strongly supports” work from home and the policy has no impact on the private sector or public sector outside Canberra, and accuses the prime minister of “lying to Australian women”.  Why he would go out there trying to deceive people, that’s a question you would have to ask him. But I think it’s actually pretty tardy and I think the prime minister has been caught out telling fibs a few times now and his record is starting to build up of somebody whose word I wouldn’t trust on some of these issues.     Updated at 12.50am BST     12.19am BST       Dutton is asked if he looked into the ownership of the port when he was defence minister. “Yes,” he replies.  And what conclusion did you draw?  Dutton says the advice at the time was “there wasn’t a need to act”.  I didn’t agree with that advice, I might say, at the time, but that was the advice that the government received, and we have now found ourselves in a position where we have the advice, it is definite, the strategic circumstances have deteriorated for our country …     Updated at 12.42am BST     12.17am BST       Dutton says if the Coalition needed to introduce further legislation to bring the port to a compulsory acquisition, he would.  It is absolutely essential that this port returns back into ownership that is consistent with the threat and the environment that we see ourselves in, in this century.  We need to make sure that when we’ve got 100 warships passing through that port or pass that port or in the vicinity of that port on a yearly basis that we can do it in a way that doesn’t raise any concerns about our national security interests and that’s why we’ve acted.         12.14am BST       Dutton is pointed to his recent reshuffle of cabinet, including appointing Jacinta Price in a role of government efficiency and waste. “Can you ensure Australians will know what waste will be before the election or will it be like Doge (the Trump administration’s own department of government efficiency)?” He says it will “be like the Howard government”.  That is they had a Labor mess to clean up. Have a look at what’s happening in Victoria at the moment. The Labor party has almost bankrupted that economy. In Queensland it was a similar story under Annastacia Palaszczuk and Steven Miles. All you are seeing with the Albanese government is the first phase of that type of governing. They’ve spent an amount of money which has driven up the cost of everything … Labor always taxes and spends, and in Victoria they are finding different ways to tax because they are running out of money. That’s how Labor governs.  In other words, we do not know what the waste will be.    Updated at 12.41am BST     12.11am BST         Last month Dutton said he would prioritise a meeting with Xi Jinping just as much as Donald Trump. Is that still true? “Yes,” he replies. Asked where today’s decision puts him in that relationship, he says the trading relationship Australia has with China is important and he wants to make sure “that we expand it”.  But ultimately, as China does, we have to make Australia stand up for her national interest. An Australian company wouldn’t be able to operate a port in Beijing and we are saying in this time, as the prime minister points out rightly, I think, we live in the most precarious period since the end of the second world war, since 1945, and I think it’s appropriate that we take the actions that meet the pressures and the concerns and the threats of the time. We can have a good trading relationship and respectful relationship with China, which is why we spoke to the ambassador ahead of the announcement that we made.     Updated at 12.52am BST     12.08am BST       Asked whether the announcement would assist with tariff negotiations with the White House, Dutton says the Coalition has been planning the policy since before Trump’s inauguration.  We have announced a policy which is in our country’s best interests. That’s been the sole motivation here. We want to make a decision and to clean up a decision that shouldn’t have been made years ago. I think what we’ve demonstrated to the Australian public is that when it comes to national security, the Coalition has the runs on the board, we understand the difficult environment in which we live and we understand the response that is proportionate.  As for whether it will antagonise China, Dutton repeats it’s “about standing up for our national interest”.  As defence minister, as home affairs minister, I think I demonstrated every day, as well as a police officer many years ago, that I will take the decisions, sometimes hard decisions, but the decisions that will make our country safe and I’ve done that over the course of my working life and it is what I want to do as our country’s prime minister as well.     Updated at 12.38am BST     12.06am BST       Dutton is asked why Scott Morrison didn’t make this decision when he was in power.  We are in 2025 and the circumstances have significantly deteriorated, even just in the last three years, let alone where it was 10 years ago, so we need to make sure we act in our country’s best interests and that’s the decision we have taken.   He says Labor had three years to “deal with this issue” and they haven’t.  This is a decision that is in our country’s best interest. We know that we live in uncertain times and the government has had three years to deal with this issue and they haven’t done that. We have taken the decision in a considered way. We will negotiate in good faith and I believe in six months we can arrive at an outcome. If that’s not the case, then we will move to make sure the asset comes back into ownership arrangements that are in line with our national security needs and our national interest, and that’s what we will apply.     Updated at 12.41am BST     12.04am BST       Peter Dutton is asked about how he feels to be “snaked” by the PM on the port announcement. He points to Anthony Albanese’s radio interview on ABC Darwin yesterday evening, calling it “incoherent”.  Anthony should have been better prepared. He’s had three years in preparation to make that phone call. It was a train wreck interview. I think, if you read the transcript, nobody was any the wiser as to what the prime minister’s actually done for three years. That’s the problem. The prime minister had three years to sort this out. The Landbridge operators have told us publicly, as you’ve seen, there’s no discussion with the government that’s been under way. So I don’t know who’s telling the truth there … There are many other examples where the government just can’t get its story right.  Dutton says the Coalition had contact with the Chinese ambassador yesterday “out of respect”.  I don’t know whether the prime minister made a call before he called ABC radio, but we have thought through this process for a long period of time, and the prime minister jumping on the phone trying to get in on the announcement that we’ve made today I think shows that this prime minister is like the fireman who turns up to the fire when the fire has been extinguished. He is too late to everything.     Updated at 12.36am BST     12.02am BST         The acting chief minister of the Northern Territory, Gerard Maley, thanks Dutton for making the announcement, incorrectly referring to him as the “federal government”.  This announcement’s going to give certainty to the Northern Territory. The political climate across the world has changed recently … only the Coalition government is going to do this in a way that’s going to benefit Territorians.  Andrew Hastie is up next before Dutton takes questions. He says Darwin is an “important part of Australian geography” for economic and national security.  Today’s announcement from Peter Dutton is critical. It’s about securing our future. It’s about securing our critical infrastructure. And it’s about making Australia safe. Because it goes without saying we are living in dangerous and uncertain times, and we need to get Australia back on track.     Updated at 12.53am BST     11.59pm BST       Dutton points to the circumnavigating of Chinese naval ships as pressing the need for the port to be returned to Australian hands.  The intelligence briefings that I’ve had over the course of my time as the leader of the opposition indicate the position has only deteriorated. We’ve now seen, of course, the circumnavigating of our country by Chinese naval ships. So we need to make sure that we recognise the times in which we live and why it’s important for us to take back this particular asset. There are about 100 warships a year – Australian and allied warships – which go through this area. And we need to make sure that, with our partners, we’re able to work constructively and in an environment which is conducive to our national security interests.     Updated at 12.21am BST     11.57pm BST    Dutton says Coalition would 'move immediately' to remove Port of Darwin from Chinese ownership    Peter Dutton is appearing in Darwin now to officially announce an elected Coalition government would “move immediately” to secure the city’s Port and remove it from Chinese ownership.  I’m pleased to announce today that an elected Coalition government will move immediately to secure the Darwin port and to make sure that we can bring that national asset … back into Australian ownership or into a model where we have greater assurance about the operator and the way in which the lease operates. There’s been a lot of debate over this issue for a long period of time. It’s clear that a mistake was made many years ago in relation to the lease and the way in which that was undertaken by the then territory government. But that is the past, and we need to deal with the strategic circumstances that we face at the moment.       Updated at 1.35am BST     11.49pm BST       Poll points to risks in key seats for Labor We’ve made it to a week into the election campaign. So who’s winning? According to the Sydney Morning Herald, Labor is exposed to a slump in support in Australia’s two most populous states despite a political recovery in recent weeks, putting key seats at risk due to the weakness of the party’s primary vote. A survey published in the outlet today shows the Labor primary vote has fallen to 30% in New South Wales and 27% in Victoria in the first three months of this year, down from 33% in each state at the last election. It’s not all bad news for Labor, though. YouGov’s latest Public Data poll suggests that Peter Dutton has recorded his worst-ever net satisfaction rating of -15, down from -2 in February. Labor takes a 2% lead over the Coalition with a 51% to 49% split in the two-party preferred vote. Meanwhile, the Australian Financial Review’s political correspondents Tom McIlroy and Ronald Mizen say Labor came out on top in the first week.  At the end of week one, it was clear that Albanese won more days than Dutton and therefore won the week. But there are still four more to go, and anything can happen in an election.     Updated at 1.33am BST     11.38pm BST       Albanese heads to Queensland and Dutton to NT It may be Saturday, but Anthony Albanese and Peter Dutton aren’t letting a weekend stop them from hitting the campaign trail. The PM is heading to western Queensland to visit parts of the region battered by recent flooding. Meanwhile, Dutton is in Darwin, marking his first visit to the Northern Territory since the campaign kicked off, where both seats are now held by Labor. He’s expected to detail the Coalition’s announcement that it would force the sale of the Port of Darwin if elected, with a press conference to come soon. Albanese took the wind out of his sails yesterday after calling in to local Darwin radio to make a similar announcement.      Updated at 11.50pm BST     11.29pm BST       Why the Coalition is trying to avoid association with Trump There was an early belief that Donald Trump’s surprise return to the White House would foreshadow a path to a Coalition election victory in Australia based on a surge in support for rightwing politics, AAP reports. But fast forward several months and local reaction to Trump’s divisive policies has upended those predictions ahead of the 3 May poll. As the US president slapped 10% tariffs on all Australian exports, Anthony Albanese and Peter Dutton have flexed their campaign muscle on how they would deal with an unpredictable American leader. While some within the Coalition initially welcomed the Republican’s victory in the presidential election, the associate professor at the United States Studies Centre David Smith says the opposition is now trying to avoid any association with Trump.  There were some figures who believed the Coalition could benefit from emulating Trump in some ways … but since he’s become president, he’s turned off a lot of Australians both in style and substance and the Coalition now appears to go in the opposite direction.  The Australian National University international law expert Donald Rothwell says Albanese has largely tried to avoid providing a running commentary on Trump’s movements but the tariff situation has made it unavoidable on the campaign trail.  The tariffs will immediately create a contest between the government and the Coalition as to who will respond the toughest and which response will be the most effective.     Updated at 11.43pm BST     11.19pm BST       Dry weather finally for Queensland’s south-west Queensland’s south-west is finally facing dry weather, giving authorities a clearer picture of the extent of the damage from flood waters. Dean Narramore, a senior meteorologist at the Bureau of Meteorology (BoM), spoke to ABC News Breakfast this morning. He said flooding was occurring on “pretty much all our rivers” through the state’s south-west, central and northern waterways.  That major flooding may continue for weeks, as we just saw a year or two worth of rainfall moving down the rivers there. We can see a pattern shift as we move through the coming week or two, as we see that shower and thunderstorm activity contract to far northern Australia … the rest of the country looking dry, which is great news for the flood-affected areas in Queensland but not those experiencing the drought conditions in South Australia and Victoria.     Updated at 11.49pm BST     11.09pm BST    Both parties back taking Port of Darwin out of Chinese hands    The Labor government is on the hunt for a buyer for the Port of Darwin despite the Chinese-owned company which holds the lease insisting it is not for sale. Anthony Albanese revealed the plan after calling in to local Darwin radio yesterday afternoon in a deliberate attempt to get ahead of a similar announcement the Coalition has reportedly scheduled for today. Landbridge Group took control of the port in 2015 after the Northern Territory government signed a $506m agreement while in financial duress. The deal gave Landbridge 100% operational control of the port. In 2023 before a trip to Beijing, Albanese ruled out cancelling the company’s lease. But speaking with ABC Darwin yesterday, the prime minister indicated he wanted commercial negotiations to take place, and was “prepared to go down the road of taxpayer direct involvement” if needed.    He confirmed that two options were on the table – for the port to be privately owned by an Australian company, or return to being a government asset. The key, he said, was that it “be in Australian hands”:  We are trying to see if there is a private buyer, particularly through superannuation funds. The [Country Liberal party] should have never flogged it off.  Albanese said the government would have “more to say” before the federal election on 3 May, but he argued Landbridge had “not had the investment into the port that’s required to bring it up to scratch”. “We don’t think that it is being utilised enough for Darwin,” he said.  Darwin has an enormous potential to be a growth area of increasing our exports through the Port of Darwin, and that is part of the context that we’re dealing with here.  Albanese said a majority of ports around Australia, like airports, were owned by superannuation funds, “which means that they’re owned by the Australian people and help to make contribution to their savings”. Full story here:   Related: Albanese declares Chinese-controlled Port of Darwin should ‘be in Australian hands’      Updated at 11.30pm BST     10.56pm BST       Do Australians want their leader to cuddle up or muscle up to Trump? Another issue for Peter Dutton is his alignment with Donald Trump’s rightwing populism on matters such as immigration, defence and cutting so-called government waste. That was looking quite good for Dutton when the new US president took office and cut a commanding figure. But since then Trump’s tariffs have sparked fears of a global recession and threaten to cause a lot of damage to the Australian economy. Josh Butler reports on how Dutton, who is slipping in the polls, might deal with this problem and steer a course away from the Trump toxicity.   Related: Donald Trump in the White House seemed like a plus for Peter Dutton. But after this week, maybe not so much | Josh Butler      Updated at 11.24pm BST     10.48pm BST       What we learned in week one on the campaign trail As flagged in the introduction, our reporters Dan Jervis-Bardy and Josh Butler have been out on the stump all week with Anthony Albanese and Peter Dutton. They have put their heads together and given an assessment of how the two campaigns have handled the first week, concluding that the Labor man has probably had the best of it fired up by his surprise tax-cutting budget and a strong message on beefing up Medicare. Albanese has looked confident, they say, and has been speaking to a message he believes voters like:  Albanese and senior Labor strategists didn’t panic as the Coalition inched ahead in the opinion polls midway through 2024. They were confident the contest would tighten and turn in their favour when voters were confronted with the “choice” of a Dutton or an Albanese government.  By contrast, they say Dutton has not responded brilliantly to being questioned all the time about policies and has seemingly lost ground:  He is under pressure, though, and facing a ticking clock on questions he refuses to answer – there’s only so much longer he can promise that the gas modelling will come “soon”, that he will announce his public service cuts “at an appropriate time”. He’s getting questions on this nearly daily, and even joking that the “anticipation” of journalists will soon wear off.  But, as they write, there’s a long way to go:  Albanese won the week. Even Dutton may admit that. But it’s just one week. “I’m not getting ahead of myself,” Albanese said. “Elections are hard to win, and there are four weeks left in this campaign.”    Related: Inside the campaign cocoon, sure-footed Albanese outboxes dour Dutton      Updated at 11.22pm BST     10.42pm BST       The true size of Australia’s devastating floods We also have a big read on the floods that have devastated western Queensland and which are now spreading to north-western NSW. The Bureau of Meteorology said yesterday that the flooding had “severely impacted” more catchments spanning about 1m sq km – bigger than NSW and even bigger than Texas – since heavy rain downpours began drenching south-west and central Queensland on 23 March. Read the full article here:   Related: Bigger than Texas: the true size of Australia’s devastating floods      Updated at 11.19pm BST     10.35pm BST    Albanese announces furlough scheme for flood-hit workers    Flood victims in western Queensland unable to work due to the deluge will be eligible for a three-month disaster allowance after the commonwealth activated the special payment scheme.  As the federal election enters its second week, the prime minister, Anthony Albanese, will visit parts of the vast outback flood zone on Saturday to announce further support.  The commonwealth will activate its disaster recovery allowance, which provides payment for up to 13 weeks for workers and sole traders who lose income as a direct result of the emergency.  The prime minister said:   The vision coming out of western Queensland is truly shocking and distressing. My thoughts are with everyone affected by this flooding – my message to Queenslanders is we are here for you.  My government has been working with the Queensland government to activate assistance and provide support.  At the worst of times, we see the best of the Australian character.  Applications for the allowance will open at 2pm on 8 April.     Updated at 10.47pm BST     10.30pm BST    Welcome    Good morning and welcome to our live news blog. I’m Martin Farrer with the top overnight stories and my colleague Caitlin Cassidy will take over. People in western Queensland who have lost work because of the floods will be able to apply for a three-month disaster allowance after the commonwealth activated the special payment scheme. Applications will be open from Tuesday, the prime minister, Anthony Albanese, announced this morning, as he said his government was “working with the Queensland government to activate assistance and provide support”. More coming up. With the election campaign into ninth day today, we look back at the first week of the race. Starting with a surprise visit to Peter Dutton’s Dickson electorate, our reporters travelling with the two teams think Labor leader Albanese has shown a real confidence in his message to voters that has left his opponent looking more wooden and predictable. More coming up. A big talking point today will be news that Labor and the Coalition have flagged plans to end a 99-year lease of the Port of Darwin to a Chinese company. Albanese dialled into a Darwin radio station yesterday afternoon to announce plans to find a new owner for the city’s port as Coalition members were en route to the Northern Territory for an election announcement on Saturday. Dutton also backs the idea. More coming up. Dutton’s enthusiasm for Donald Trump’s rightwing populism is being tested now that the US president has cast doubt over Australia’s military alliance with America and after he has seemingly taken a wrecking ball to the world economy. With US and European markets once again under the cosh overnight, we have been looking at how the Coalition leader can distance himself from the man in the White House. More coming up.    Updated at 10.35pm BST  ", "One Australian’s dramatic rescue from a flood in one of the driest places on Earth [2025-04-01T07:49:17Z]": "Many are those rescued from Munga-Thirri-Simpson Desert – in what is normally the dust bowl of outback Queensland – who have sunk wheels in a sand dune, busted tyres upon gibber rock or even been bogged in the mud left by a sudden downpour. But Tony Woolford is among a far more exclusive club. \nIn fact, the 66-year-old South Australian may well be the first person ever plucked by helicopter in this, one of the driest places on Earth, from flood waters. \nAt least, that is according to the man who coordinated his rescue, Don Rowlands. \nA lifelong resident of Birdsville – the iconic gateway town to the Simpson – Rowlands has seen “stacks” of rescues in Queensland’s outback south-west over his 31 years as a desert ranger. \n“A lot of them having troubles now when these new fang-dangled computers throw in the towel,” the 76-year-old Wangkangurru Yarluyandi elder says. \n“Computers in the cars, you know, just some little thing goes wrong and you can’t get them to go again. \n“But anyone rescued from floods in the desert … no, not that I can recall. \n“I think this is the first you know?” \nIt certainly won’t be an experience Woolford will forget in a hurry. \nWhen heavy rain turned the Madigan Line track he was driving to mud, Woolford was stranded in his 4WD for five days, watching the rising flood waters come to within a metre of his refuge before he was airlifted to safety. \n“I thought I would float away,” he told the national broadcaster after his rescue last week. \n  \n  \n   \n  \n  \n \nHad he done so, perhaps he would have ended up in Kati Thanda-Lake Eyre. \nWith vast swathes of outback Queensland inundated and many places receiving more than a year’s worth of rain in a matter of days, flood waters are gradually making their way to the lowest place in Australia – that arid salt pan is set to transform into ephemeral lake. \n Interactive \n \nAs those flows pass towns and cattle and sheep stations – normally isolated by desert, plain and sheer distance – many sit as islands in a muddy sea. \nBirdsville has been cut off for more than a week, Rowlands said, and on Tuesday, the town was preparing for flood waters to rise once more as the remnants of ex-tropical cyclone Dianne wash into Queensland from the west. \nBut “no one is complaining”, he said. Food was being flown in weekly from Boulia, almost 400 kilometres to the north. The town’s iconic pub was not going to run out of beer – they have their own plane. \nThe situation for others was more dire. At least one dad did a school run to the remote town of Jundah, in a tinnie last week. Days later, at least 25 people were airlifted from the town in helicopters as the Thomson River burst its banks. \nAdavale, about 195km further to south-east was also evacuated. \nMayor of the neighbouring Longreach shire, Tony Rayner, said his council was providing refuge for those who fled Jundah – while make their own flood preparations. \n“The situation there is really unprecedented, and we’ve been helping as much as we can to receive evacuees and assist with resupply,” he said. “There’s a lot of water up there”. \nRayner said the full effects of the flood would not be known for weeks. \nBut early estimates from the Queensland Department of Primary Industries (DPI) were already pointing to potentially devastating loss of cattle and sheep. \nThe DPI said that estimates from Monday afternoon indicated more than 140,000 livestock were missing or dead – and that figure was set to rise. \nRayner said “significant stock losses for western Queensland” would “have an impact on every community out here”. \n“Not only economically, but psychosocially – we’re already getting reports of landholders that are struggling mentally with the prospect of what they know is to come,” he said. \n“The trauma isn’t just damage to homes and possessions – it’s losing beloved animals, generations of blood lines, and in some cases faithful companions.” \nA clearer picture may begin to emerge later this week, according to Miriam Bradbury from the Bureau of Meteorology. \nThe senior meteorologist said the rain was continuing to fall in many places on Tuesday, prolonging a weather event that officially began on 23 March as an inland low that dragged monsoonal rain from the tropical north to the arid south, but has been complicated by the likes of Dianne. \n“From the 23rd onwards we’ve seen huge amounts of rain falling across western and inland Queensland,” Bradbury said. \n“Across some parts of southern and south west Queensland, several locations have exceeded their annual average rainfall in just a three-day period.” \nThe meteorologists said most areas under flood warnings should see widespread clearing of skies by Thursday, but that forecasting the rain had been made “so challenging” by “one rainfall event flowing into the next”. \n“For places around Birdsville those rivers are still rising … and have actually seen multiple flood peaks move through,” she said. \n  \n  \n   \n  \n  \n \n“It rises, it comes down a little, and then it rises again as that next bout of rain moves through the catchment. \n“That’s certainly caused massive and long lasting disruption”. \nWhile the channel country of the outback south west was used to periodic flooding, Bradbury said such a “huge amount of rain” over a period of days “sets this apart from other events”. \n“That’s what is going to make it remembered very distinctly,” she said. \nBut amid the challenges and the loss, Rowlands said the normally dusty flood plains around his home town were already lush and green and “pretty magic”. \nAnd when the waters do recede, he expects these landscapes, normally among the harshest in the world, to explode with life. \n“Mate the country will be like a garden,” he said. \n“It’ll be a sea of flowers”.", "Bigger than Texas: the true size of Australia’s devastating floods [2025-04-04T14:00:57Z]": "The extent of flood waters that have engulfed Queensland over the past fortnight is so widespread it has covered an area more than four times the size of the United Kingdom. The inundation is larger than France and Germany combined – and is even bigger than Texas. \nThe seemingly endless plains of outback Queensland are so vast and remote as to boggle any attempts to visualise the scale of what is being described as one of the most devastating floods in living memory. \nThe Bureau of Meteorology said on Friday that the flooding had “severely impacted” more catchments spanning about 1m sq km since prolonged downpours began drenching south-west and central Queensland on 23 March. \nTo put that in perspective, Tasmania is 15 times smaller (64,519 sq km or 24,911 sq miles); the land area of the United Kingdom is 241,930 sq km, and Texas is 695,662 sq km. \nThe flooded area is more than four times the size of Victoria (227,038 sq km) and bigger than New South Wales (801,137 sq km). It is about the same size as Egypt and about half the size of Saudi Arabia or Mexico. \nIf the flooding were a country, it would be the 31st largest on Earth. \nThe bureau said many stations across the Queensland and New South Wales interior had broken their March or annual rainfall records. \n“In four days (from 23 to 26 March) parts of southern and south-western Queensland had more than their annual average rainfall,” a BoM spokesperson said. \n“Widespread major flooding continues for parts of Queensland and far northern New South Wales [and] this is likely to continue for many weeks as flood waters slowly move downstream. \n“Flood water will drain slowly towards Kati Thanda-Lake Eyre through the south-west Queensland catchments, with a clearer picture of what may eventuate as flood peaks begin to move downstream.” \n Interactive \n \nTiny, far-flung towns have been evacuated – in some, such as Adavale, every resident has departed. Others will remain cut off for weeks, despite the heavy rain having passed, as the deluge slowly makes way through flat and sodden country via slow moving rivers. \nAlong with the loss of property and damage to homes, farmers were bracing for the slowly receding water to reveal the extent of agricultural devastation. \nThe premier, David Crisafulli, told the Queensland parliament on Thursday afternoon that the number of livestock lost to flood water had gone past 150,000. \n“I do believe that, sadly, that number will continue to rise in days ahead,” Crisafulli said. \nThe premier said 4,552km of fencing had been destroyed. \nSpeaking from Longreach earlier in the week, he said of particular concern was the loss of exclusion fencing that protected stock from canine depredation, which had been rolled out over recent decades and was crucial to the survival of the sheep industry. \n  \n  \n   \n  \n  \n \nRoyal Flying Doctors Service base support manager in Charleville, Liane Spencer, said communities like Yowah had been cut off from health care for weeks and were relying on helicopters to drop off medication – as well as food and fodder – and to extract people who needed medical attention. \nThat lack of primary health care could have “really major impacts” on the largely elderly communities with some “very complex medical situations,” she said. In addition to the physical challenges, Spencer said there would be “a lot of very sad people around the country”. \n“There’s been so many homes inundated, they’ve basically had to walk off with just clothes on their back – leave their pets and leave their stock – and then come back to the unknown,” she said. \n \n  Related: One Australian’s dramatic rescue from a flood in one of the driest places on Earth  \n \n“And they’re coming back and finding dead kangaroos in their garden, dead pigs in their chook pens and then, once they can get out and about a little bit, just seeing the impact that it has had on their own livestock … that has ramifications. \n“Some property owners just can’t come back from that – so there will be a lot of mental health issues ongoing for a long time.” \nDr Piet Filet from Griffith University’s Australian Rivers Institute said that some stock that survived the flood waters would be battling heavy clays and thick mud and would be at risk of sickness. \nBut Filet said the vast inundation would also replenish parched soils, recharge the groundwater systems upon which outback communities and industries are dependent for drinking and agricultural water and bring ephemeral ecosystems bursting into life. \n“Flooding is the natural process through which our soil fertility is maintained,” he said. \n“There are places out there that hadn’t seen rain for two to three years. \n“This is the pulse of western Queensland.”", "Northern NSW braces for heavy rain as Queensland flooding forecast to move south [2025-04-02T07:27:16Z]": "Hundreds of emergency workers have been deployed in northern New South Wales as the impact of heavy rain and flooding in Queensland moves south. The mid north coast, northern rivers and northern tablelands regions were bracing for moderate to heavy rain, with forecasters on Wednesday warning of swollen rivers flooding.   Related: Outback deluge pushes Queensland towns to the brink: ‘Out here it’s drought or floods’    NSW State Emergency Services (SES) said it had activated more than 750 personnel, high clearance vehicles and flood rescue teams in the state’s north. The SES was mobilising in response to heavy rain forecast on Wednesday night, particularly along the Queensland-NSW border, with 20-40mm of rain likely.    We&#39;ve deployed 750+ personnel, helicopters &amp; high clearance vehicles as impacts of rainfall and floodwaters moving south from QLD are felt across the state. 👉 https://t.co/qcSOT5UkPf📷 Crews capturing flood intel on the way to Mungindi, and pre deployed assets in Grafton. pic.twitter.com/FIlQCQKE1m&mdash; NSW SES (@NSWSES) April 2, 2025   The Bureau of Meteorology’s Dean Narramore said a band of rain had moved from western and central Queensland to the south-east of the state and north-east NSW. Those regions were at risk of flooding, Narramore said, with 30-50mm of rainfall possible.  Sign up for the Afternoon Update: Election 2025 email newsletter  Catchments in northern NSW likely to be affected by minor flooding included the Richmond, Wilsons, Clarence, Bellinger and Upper Macintyre rivers. The NSW SES assistant commissioner, Sean Kearns, warned flash flooding was a real risk. “The catchments in this part of the state are already saturated, so any rain we see tonight could lead to flash flooding, which can occur quite quickly,” Kearns said. Sixteen public schools have so far been closed. A spokesperson for the NSW education department said six schools in the Narrabri local government area were closed, with more closures possible.  “Following a request and advice from the SES, a number of schools in the Narrabri LGA are not operating due to rising flood waters and safety risks in the area,” they said.  “Where possible schools are arranging options for students to work from home to minimise disruption to their learning”.", "Afternoon Update Election 2025: Greens want 1% of budget for environment; Dutton ready for fight with Trump; and Val Kilmer dies aged 65 [2025-04-02T06:13:55Z]": "Hello readers, and welcome to today’s election edition of Afternoon Update. We’ve made it to day six of the campaign and gaffes about the price of bread or the rate of unemployment have not made headlines (yet?). Anthony Albanese and Peter Dutton both started their days in Victoria, talking big on the economy before the Trump administration’s latest tariff announcement. The PM jetted off to Tasmania before midday to plug a healthcare hub but still had time to read to small children in Melbourne, while the opposition leader toured the outskirts of the city, partaking in tea with a mortgage-stressed family and visiting a mental health centre. Meanwhile, the Greens have been in the flood-stricken NSW town of Richmond, launching an election plan to increase environment spending. Today’s big stories    The Greens have promised to push the government to boost environment spending to $7.8bn – 1% of the federal budget – next financial year if they hold the balance of power after the election. The party’s pitch came as the shadow treasurer, Angus Taylor (pictured), delivered his budget reply at the National Press Club in Canberra, declaring the “election is about the economy” and flagging a small business policy package to be unveiled “over the coming weeks”. Speaking of things yet to be unveiled (the clock’s ticking!), Dutton hasn’t ruled out cuts to the ABC and is still refusing to say which public servants will be axed as part of his plan to slash 41,000 jobs. Pressed on when the costings would be released, Taylor said he wouldn’t delve into the “sausage-making process” but it would be before the federal election. What they said    “If I needed to have a fight with Donald Trump … I’d do it in a heartbeat, and I’ll put the Americans on notice.” *** Dutton channelled his inner “shirtfronting” Tony Abbott on Sky by talking tough on his ability to stand up to world leaders in the national interest. The opposition leader was asked whether Labor’s repeated comparisons of the Coalition to the Trump administration were hurting the Liberal campaign, including the treasurer calling him “Doge-y Dutton” in reference to the US department of government efficiency. How social media saw it    The Coalition wasted no time in rolling out official campaign posters poking fun at Monique Ryan, whose husband Peter Jordan was filmed last month removing a promotional sign for Kooyong’s Liberal candidate, Amelia Hamer. Jordan later apologised, admitting he made a “mistake” in taking the sign – which he thought was illegally placed – from outside the home of a Coalition supporter. If you thought that would be the end of the matter, think again. The Liberal party took to X to share their new creation, which reads, “Monique, please DO NOT take this sign!” We have four more weeks of this. The big picture    Election campaigns go by fast. Sometimes it’s nice to stop and smell the roses. Or, in this case, the sunflowers. Dutton had a chance to do just that when he left a press conference at the estate home of a family in Donnybrook, north of Melbourne, who had an impressive bed of sunflowers in their front garden. The outer suburban, mortgage belt electorate is held by Labor, but only by a 3.8% margin. The Coalition needs to flip 19 seats to gain a majority, making marginal contests like this critical for Dutton to secure a path to victory. Watch    The electoral roll will snap closed at 8pm on 7 April, meaning you only have a few days to enrol to vote or update your details. As part of Guardian Australia’s Voting 101 series, Matilda Boseley guides you through what you need to do to make sure you’ll be able to turn up and vote on election day And in other news …  Val Kilmer, star of Top Gun and The Doors, dies aged 65, NYT reports Myanmar earthquake deaths set to pass 3,000 as looming monsoon sparks urgent call for aid Australian exporters brace for immediate US tariffs on Trump’s ‘Liberation Day’ Jacinta Allan denies Victoria police force is in chaos as another top cop quits RPA hospital closes HIV psychiatry clinic with 200 patients after staff resignations Ukraine war briefing: US pressure builds on Russia over refusal to accept ceasefire  Daily word game    Today’s starter word is: ILIA. You have five goes to get the longest word including the starter word. Play Wordiply. Sign up If you would like to receive this Afternoon Update: Election 2025 briefing to your email inbox every weekday, sign up here, or start your day with a curated breakdown of the key stories you need to know with our Morning Mail newsletter. You can follow the latest in US politics by signing up for This Week in Trumpland.", "Queensland’s recovery to ‘take months and years’ after floods sweep across vast interior [2025-04-02T05:22:12Z]": "Queensland’s premier has declared “day one” of a recovery that will take years as the state prepares to wake to clear skies that should reveal the vast scale of its outback floods. \nBut despite forecasts the rain will pass for soaked central and south-west Queensland by Thursday, towns and homesteads could be cut off or at risk of flooding for weeks to come, forecasters warned. \nAccording to the Bureau of Meteorology’s senior meteorologist, Dean Narramore, there will be more flooding to come after a band of rain dumped falls of between 50mm to 100mm in the 24 hours to 9am on Wednesday across an area of central Queensland from Mount Isa down towards Charleville, including falls of 161mm in Tambo. \n  \n  \n   \n  \n  \n \n“All the rainfall overnight is going to lead to prolonged flooding out west as well as renewed river level rises,” Narramore said. \nNarramore said that most of the 50mm to 100mm fell on the upper catchments of “very large and very slow moving rivers” that were already undergoing major flooding. \n“So that will continue to feed down in the coming days and weeks,” he said. \n“There’s incredible flooding out there, and likely to continue for days, if not weeks, right across south west Queensland”. \nNarramore said the new downpours – that had continued a weather event the bureau officially dates to 23 March – were weakening as they headed south-east and should move offshore by Wednesday evening. \nNarramore said clear skies forecast for Thursday inland should reveal rivers swollen tens of kilometres wide and muddy seas and lakes upon normally parched plains. \n“You’re going to see some incredible imagery I’m sure tomorrow from this huge part of south-west Queensland that is currently flooded,” he said. \nAnd as the flood waters eventually drain to the Kati Thanda- Lake Eyre or down the Murray Darling basins, entire towns will gradually emerge from the muck. \nThe Queensland premier, David Crisafulli, said he had met 28 people from the town of Adavale who had been evacuated about 85km down the Bulloo River to Quilpie. \n \n  Related: Northern NSW braces for heavy rain as Queensland flooding forecast to move south  \n \n“Across the 20 homes, every single one of those homes has damage in that habitable area,” Crisafulli said. \n“So there’s not a single place in that community where you can use as the rebuild, not a single place that you could say people can go to that life can be a bit normal.” \nMany, such as the Cowley family in Adavale, described being rescued as the flood waters closed in on properties. \nStephen Cowley said he had to “push the two daughters and granddaughter up on the roof” where they were whisked away by a helicopter. \n“They were getting panicky. Imagine the downforce from the propellers and they are trying to scramble along a roof underneath it.” \nCowley described seeing the helicopter that picked up his neighbour crash in a nearby yard and watching as the “pilot was swept down the creek about 2km onto a tree” before he was rescued alogn with the neighbour. \nSpeaking from Longreach on Wednesday morning, Crisafulli said that 90 people from Thargomindah were in an evacuation centre as flood waters continued to rise there and that he had also met with residents of Jundah who had been evacuated to Longreach. \n“There’s no doubt that some of the smaller communities, Adavale, Jundah, have really copped a beating through this”. \nAs well as damage to property, the premier said the magnitude of stock losses “continues to rise” – with the latest estimate of lost or dead livestock “now approaching 150,000”. \n“That’s somewhere in the order of 70,000 cattle, 70,000 sheep and 10,000 goats and horses,” he said. “And, I stress, this number will continue to rise. This is only the first stage of the damage assessments”. \nThe agricultural industry will also have to patch or rebuild about 4,700km of private roads that have been affected and about 3,500km of fencing, with Crisafulli highlighting the need to rebuild exclusion fencing rolled out over recent decades to protect the sheep industry from canine depredation – or face a return of what he called “the bad old days of wild dogs roaming free”. \n“This is not going to be a recovery that happens in days or weeks, this recovery will take months and years,” he said. \nThe recovery will include the construction of a $10m new weather radar in western Queensland after the federal emergency management minister, Jenny McAllister, said Labor would match a commitment made by the Coalition on Monday.", "How historic is what we’re seeing in the Queensland floods? It’s hard to grasp the full magnitude [2025-04-05T20:00:35Z]": "When Dorothea Mackellar wrote of flooding rains more than a century ago, she couldn’t have anticipated anything on the scale of the current deluge in Queensland. \nThe downpour, which began as a lingering low-pressure trough topped up by rain from ex-Tropical Cyclone Dianne, has dumped a phenomenal amount of water on to outback towns and cities, inundating homes, cutting access to communities and causing stock losses in excess of 150,000. \n \n Sign up for the Afternoon Update: Election 2025 email newsletter \n \nThe resulting floods – the boom in the boom-bust cycle that characterises this arid landscape – have filled dryland rivers and expanded across wide and flat plains, reaching a scale not seen since European colonisation. \nHow exceptional was the flooding? \nGriffith University professor Fran Sheldon, a river ecologist specialising in dryland river systems, says the floods were “massive” and “probably at the extreme end of the boom”. \n“It’s covering flood plain areas that haven’t been inundated in European memory,” she says, although evidence from soils and fish genetics suggest floods of this scale have happened before.&nbsp;&nbsp; \nInland flood waters are expected to take weeks, or even months, to move downstream into South Australia, towards Kati Thanda–Lake Eyre. \n Interactive \n \nKati Thanda’s river catchment spans 1.2m sq km – more than a seventh of the Australian landmass – including parts of Queensland, South Australia, the Northern Territory and New South Wales. Rainfall and river flows are extremely variable, fluctuating between long dry periods and sporadic rainfall. \nAccording to flood gauges, the enormous body of water has surpassed the 1974 event, widely considered the largest flood in Queensland history. But it was still sitting within the floodplain, Sheldon says, just “reaching the edges” of where people thought it would go. \nThis was a natural phenomenon, Sheldon says, even though the devastation experienced by towns and communities was awful. \n“The beauty of these river systems is that they are some of the last unregulated rivers in the world. What we’re witnessing is just rivers being rivers. There are no big dams on these systems. There’s no massive irrigation industry. So this is just what big rivers do.” \nSo much water, where did it all come from? \nAbout two weeks ago, heavy and relentless rain started falling across normally dry inland areas of Queensland as a slow-moving trough dragged tropical moisture inland. \nThe skies briefly cleared this week before the remnants of ex-Tropical Cyclone Dianne brought further rain to already sodden areas.&nbsp;&nbsp; \nRainfall records have tumbled across the state. \n \n  Related: Bigger than Texas: the true size of Australia’s devastating floods  \n \nAccording to the Bureau of Meteorology, broad areas of western Queensland received up to four times their March average rainfall. In four days – from 23 to 26 March – parts of southern and south-western Queensland had more than their annual average rainfall. \nThe airport at Winton, Australia’s dinosaur capital, recorded 158mm on 26 March, 56mm higher than the previous daily rainfall record for March. A day later, 177mm fell at Dillalah station, off the Mitchell Highway about 700km west of Brisbane, breaking its record by 31mm. The pastoral lease received so much rain throughout March – 417mm in total – it nearly doubled its monthly rain record. \nThe bureau said the Paroo, Bulloo, Cooper and Thomson catchments recorded their biggest floods in 50 years. \nThe lingering trough, together with ex-Tropical Cyclone Alfred, resulted in the state’s third-wettest March. \nDr Andrew King, an associate professor in climate science at the University of Melbourne, says when low-pressure systems drew air down from the north, it tended to be warm and moist, creating perfect conditions for heavy rainfall. \nFlooding in northern Australia during the wet season isn’t uncommon, he says, although it is unusual to see multiple exceptional flooding events.&nbsp; \nWhile winds generally move weather systems across the country, King says sometimes low-pressure systems linger and get “kind of stuck in place for a while” if there is a high pressure system nearby. “If the systems hang around for long enough, then the flooding tends to be worse.”  \nThere isn’t yet conclusive evidence about whether climate change is contributing to these stationary events, he says, although it is something researchers are looking into. \nClimate change is increasing the amount of moisture the air can hold, which can lead to heavier rainfall.  \nCould we have been more prepared? \nDr John Macintosh, a water engineer and former National Committee on Water Engineering of Engineers Australia chair, says that in inland rural Australia, infrastructure such as dams, levees or diversions do little to reduce the impact when such huge volumes of water are involved. \nMore moisture in the atmosphere created the conditions for higher rainfall, which could spread further across a flat landscape, he says.&nbsp; \n“More volume of water … means we’ve got greater areas that have been impacted,” Macintosh says, all amplified by growing populations, farming and industrial activities. \nGovernments are improving their disaster management capabilities, but he says more early warning and monitoring systems will reduce potential flood damage. Engineers can help, he says, by drawing on rainfall, flood gauge and river flow data and using mapping to better forecast the expected timing and depth of flood events. \nWhere to from here? \nMost of the water currently sitting over Cooper Creek and the Georgina, Diamantina river systems will eventually make its way into Kati Thanda–Lake Eyre. \nThe “great big creeping mass of water” is moving at a walking pace, Sheldon says. But once it reaches Kati Thanda – in weeks or months – it will probably fill the lake, a rare event that only occurs a few times each century. “We’re looking at something pretty unique,” she says. \nAs the flood waters progress, wetting soils and filling up rivers and wetlands, nutrients and invertebrates will provide a ready food source for fish and waterbirds. \n“A lot of those floodplain soils contain eggs of small invertebrates, the zooplankton that hatch when they get wet. There’s an instant boom of this incredible food source for fish, and they’ll just be out there feasting and growing and breeding again and making the most of it.” \nWhen the water finally reaches its destination, brine shrimp would hatch from the salty sediment providing food for millions of waterbirds. \n“It’s not just Kati Thanda that will boom. All these wetlands will be covered in water birds and be covered in fish and be booming as well,” she says. “It’ll be spectacular.”", "The disaster relief payments you may be eligible for after western Queensland’s flooding and ex-Tropical Cyclone Alfred [2025-04-06T01:16:42Z]": "Within just one month, Australia has faced a series of devastating weather events, from ex-Tropical Cyclone Alfred wreaking havoc in northern New South Wales and south-east Queensland, to flooding in western Queensland. In response, the prime minister, Anthony Albanese, alongside state governments, has announced several types of disaster relief assistance to support those affected. “At the worst of times we see the best of the Australian character,” Albanese said in Longreach in western Queensland on Saturday. “My message to Queenslanders in this difficult time is we’ve got your back and will support you through the recovery.” Here’s what we know about the support on offer.  What did Albanese announce for western Queensland?   Following heavy rainfall and flooding in western Queensland, which began on 21 March, Albanese announced the disaster recovery allowance would be available for 15 affected local government areas. They are: Barcaldine, Barcoo, Blackall-Tambo, Boulia, Bulloo, Central Highlands, Diamantina, Flinders, Longreach, Maranoa, Murweh, Paroo, Quilpie, Richmond and Winton. This allowance offers up to 13 weeks of income support for eligible workers and sole traders depending on their personal circumstances who have suffered a loss of income as a direct result of the event. He also announced $105m, jointly funded with the Queensland government, to repair thousands of kilometres of exclusion fencing damaged by flood waters so far, to protect livestock from feral pigs and dogs. An additional $7m will also be spend on fodder for livestock. Who is eligible for the disaster recovery allowance?   To be eligible you must be:  Sixteen years or older. A worker or sole trader who has suffered a loss of income as a direct result of the event. Able to prove your income has fallen below the average Australian weekly income as a result of the floods. Living in one of the 15 LGAs affected by the Queensland floods or the 31 declared cyclone-affected areas in south-east Queensland and northern NSW.  You can check your eligibility here. How much is the disaster recovery allowance?  Money will be paid fortnightly at either the jobseeker or youth allowance rates, depending on your personal circumstances. The maximum amount available, equal to the maximum jobseeker payment, is $1,007 a fortnight. Is the allowance difference to the disaster recovery payment?   Yes, the disaster recovery payment is a one-off lump sum payment while the disaster recovery allowance is a short-term, ongoing income support payment for those affected by a disaster. To be eligible for a disaster recovery payment you must have suffered the most extreme impacts including major damage to your home, serious injury or loss of a loved one as a result of either the western Queensland floods or ex-Tropical Cyclone Alfred. You can check your eligibility here. Eligible residents can receive $1,000 per adult and $400 per child. How do I apply for the disaster recovery payment?  The easiest way to apply is online, through your myGov account. If you need further assistance with your claim, call the Australian government emergency information line on 180 22 66. And what about state government grants?  Both the Queensland and NSW governments have also announced personal hardship financial assistance grants available for communities impacted by the weather events. Each has specific eligibility requirements, however, for people in Queensland, you must be:  In one of the impacted areas listed here (for the western Queensland floods) or here (for ex-Tropical Cyclone Alfred). Aged 18 years or older – if you are under the age of 18, you can contact the community recovery hotline on 1800 173 349 to get advice on how to lodge an application.  To check which grants you may be eligible for in Queensland, fill out the online form available here. Meanwhile, in NSW, a one-off payment of $180 for individuals and up to $900 is available for essential costs such as food, clothing, medicine and emergency accommodation. To be eligible you must be:  In one of the impacted areas for the listed here. Aged 18 years or older. Have been subject to an evacuation order, with a category “red” emergency warning, or have experienced a power outage of more than 48 hours.  You will need:  A MyServiceNSW account with your details up to date. Proof of identity, such as a document that shows your full name and date of birth. You may also need details from two identity documents (such as Australian driver’s licence, Medicare card or passport). Your bank account details to receive the payment.  Applications opened on 12 March and close on 8 April.", "Morning Mail: Trump to reveal tariff hit, outback floods loom in NSW, Democrats roast Musk as Tesla sales slump [2025-04-02T19:48:57Z]": "Morning everyone. Donald Trump is expected to reveal in the next hour which tariffs he is going to place on imports from Australia and other countries in his much-waited “liberation day” announcement. We have full coverage on what it means for the economy and the world. \nWe also have the latest on concern about electioneering on the app Rednote, the threat of massive flooding in northern New South Wales, and can US border guards really confiscate your phone? \nAustralia \n  \n  \n   \n  \n  \n \n \n Flood warning | Hundreds of emergency workers have been deployed in northern New South Wales as the impact of heavy rain and flooding in Queensland moves south. The risk of flooding could last for weeks, forecasters warned, and the state premier said recovery could take years. \n Exclusive | Disinformation experts have accused migration agents of sharing false information about Anthony Albanese and Peter Dutton on the Chinese social media app Rednote to win clients, including claims Australia has turned “wicked” and is actively targeting Chinese people. \n Border force | Amid reports of visitors to the US being asked to surrender their phones for checking at airports, we have tried to answer a few key questions for travellers and their rights. It comes as the musician Neil Young said he could be banned from returning to the States after his European tour this year because of his criticism of Donald Trump. \n Victoria cuts | The Victorian magistrates court is considering cutting more than a quarter of its backroom staff despite the prospect of its workload increasing as the Allan government presses ahead with “tough on crime” policies. \n ‘Landlord’s market’ | Rents are growing at the slowest rate in four years thanks in part to increased supply, a new report shows, but are still at record highs and it’s still a “landlord’s market”. \n \nWorld \n \n Tariff time | As the world awaits Donald Trump’s tariff announcement, the Australian government has not ruled out taking Washington to the World Trade Organization if it is targeted in the “liberation day” regime to be imposed this morning. The UK government says it is prepared for “all eventualities”, we have an explainer on how the European Union might respond, and one more generally looking at tariffs and why they matter. Follow developments live. \n ‘Loser’ Musk | Democrats were celebrating after the election for a vacant Wisconsin supreme court seat turned into a repudiation of Elon Musk, who spent millions on the Republican candidate but was branded a loser by gleeful opponents. In a bad day for the tycoon, Tesla said sales fell 13% worldwide in March. \n Gaza | Israel’s defence minister has said the country intends to “seize large areas” of the Gaza Strip amid a major expansion of aerial and ground operations in the besieged Palestinian territory. A doctor who examined the bodies of some of the 15 paramedics and rescue workers shot dead by Israeli forces has said there is evidence of execution-style killing. \n Dementia hope | Researchers who tracked cases of dementia in Welsh adults have uncovered the strongest evidence yet that the shingles vaccination reduces the risk of developing the devastating brain disease. \n Myanmar miracle | A man has been pulled alive from the rubble of a hotel in Myanmar, five days after the country’s worst earthquake in a century. \n \nFull Story \nIs Dutton’s gas plan just hot air? \nThe climate and environment editor, Adam Morton, tells Reged Ahmad how Peter Dutton’s plan to bring down gas prices might work and what it means for climate change. \n  \n  \n   \n  \n  \n \nIn-depth \nWe continue our election coverage by looking at how Peter Dutton could find it tricky to keep the pro-coal Nationals onside if he has to seek support from teal independents in the event of a hung parliament. The economic outlook looms large over the election and our columnist Greg Jericho thinks it very likely that falling inflation means more interest rates relief is on its way. And the former Aboriginal and Torres Strait Islander social justice commissioner Mick Gooda says the leaders of the major parties have lost the courage to pursue meaningful change after the defeat of the voice referendum. \nNot the news \nKai Sakakibara was an Olympic hopeful in BMX racing when he suffered a catastrophic crash while competing in Bathurst, leaving him with a life-changing brain injury. Kieran Pender visited him to talk about his years of rehab, coming to terms with his injuries, and how he is now hoping to race for Australia in the 2028 Paralympics. \nSport \n \n Football | Ange Postecoglou admits that there are “outstanding candidates” who could take his job if his Spurs team does not improve with a tough test away at Chelsea tomorrow. There are six Premier League matches this morning with the Merseyside derby and Newcastle v Brentford among the highlights. Follow the action live. \n Basketball | The Denver Nuggets star Nikola Jokić registered only the third 60-point triple-double in NBA history but still saw his team suffer a 140-139 double-overtime loss to the Minnesota Timberwolves. \n Cricket | Australian all-rounder Cameron Green heads the list of overseas talent recruited by English counties before the start of the championship season tomorrow. \n \nMedia roundup \nCatholic schools have said the “ideological” national curriculum should be abolished to stop the slide in academic performance by boys, the Australian reports. Record cases of flu in Victoria bode ill for the winter months, the Age reports. The Telegraph offers a sneak peek inside the new Powerhouse Museum in Parramatta. \nWhat’s happening today \n \n Economy | The ABS releases figures for international trade and job vacancies, and there are also stats on new vehicle sales. \n Media | ABC chair Kim Williams speaks at the Melbourne Press Club. \n \nSign up \nIf you would like to receive this Morning Mail update to your email inbox every weekday, sign up here, or finish your day with our Afternoon Update newsletter. You can follow the latest in US politics by signing up for This Week in Trumpland. \nBrain teaser \nAnd finally, here are the Guardian’s crosswords to keep you entertained throughout the day. Until tomorrow.  \n \n Quick crossword \n Cryptic crossword \n", "What are anti-dumping laws and why does Australia need them? [2025-04-04T23:00:06Z]": "Trump’s sweeping new tariffs have left global markets in turmoil and Norfolk Islanders scratching their heads. Politicians, economists, and everyday people around the world have been scrambling to understand what it all means and what happens next. \nWhile officials in Canada, Europe and China talk tough, the response in Australia has been more muted. \nThat tells us two things. \nFirst, that we don’t export a huge amount to the US, and there is a rare consensus that trying to retaliate would only hurt us more. \nSecond, that with the new tax on Australian goods exported to the US of “only” 10%, we have escaped relatively lightly – especially as pharmaceuticals have so far been exempted. \nBut our leaders must be seen to be doing something. \nSo it was that Anthony Albanese on Thursday immediately announced a range of measures designed to soften the blow to those local exporters who might get hurt by US trade aggression – either indirectly, or directly. \n \n Sign up for the Afternoon Update: Election 2025 email newsletter \n \nAnd first cab off the rank from the PM was this pledge: “We will strengthen our anti-dumping regime to safeguard key sectors like steel, aluminium and manufacturing against unfair competition.” \nWhat is dumping, and why are we so worried? \nThe fear is that countries who have now been slapped with much higher US tariffs, such as China and Vietnam, could struggle to sell their products in America and choose instead to dump them at below cost in other markets – such as Australia. \n \n  Related: Trump’s tariffs could deliver a $27bn blow to Australia – and the cost of a global trade war would be far higher  \n \nThat could hurt local manufacturers who can’t compete with imported goods being sold at unfairly low prices. In the worst-case scenario, they could be forced out of business. \nHow likely is that? \nA flood of cheap imports at fire sale prices is not in the immediate future. \nBut it’s hard to know how worried we should be, and the risk of a rise in dumping cases is higher than it was on Wednesday. \nFor now, talk of beefed-up anti-dumping measures is mostly just that – talk. Behind the scenes, diplomats and trade representatives will be talking with their overseas counterparts to stop an unruly rush to dump unwanted goods in each others’ markets. \nThe government plans to spend an extra $5m to boost the capacity of the Anti-Dumping Commission to deal with a potential increase in the number of cases. \nThe commission, which sits in the Department of Industry, investigates claims by local producers who say they are the victim of unfair trading practices by overseas competitors. \nIs dumping always bad? \nNot if there isn’t a local producer who is being unfairly disadvantaged. \nFor example, China could choose to “dump” cut-price electric vehicles on our shores. With no local car manufacturers, that would just mean cheaper cars for us. \nWho decides whether goods have been dumped? \nThe industry minister of the day will make the call, based on the recommendation in a final report presented by the Anti-Dumping Commissioner. \nThe final report is supposed to be produced within 155 days of the complaint being lodged, although cases can start, stop and restart. \n  \n  \n   \n  \n  \n \nThe process to lodge a complaint is long and arduous, though, and the paperwork is hideous, says Louise McGrath, the head of industry development and policy at Ai Group. That puts off a lot of would-be complaints, especially by smaller firms. \nSome companies, however, are practised complainants. \nIn fact there is the risk that anti-dumping rules can be exploited by local firms trying to shield themselves from offshore competitors who are simply more efficient. \nJenny Gordon, a non-resident fellow at the Lowy Institute, uses the example of the steel manufacturer, Bluescope, which she says “excessively used antidumping to limit competition”. \n“As a result Australians pay more, and that raises building costs,” Gordon says. \nSo which products are already on the naughty list? \nThe Anti-Dumping Commission’s website lists 24 imported products or commodities that have been found to be sold in Australia at unfairly low prices and are paying the penalty. \n \n  Related: Breaking with the US will be painful for Australia in many ways – but it’s inevitable | John Quiggin  \n \nThey are almost all manufactured metal products, and predominantly from China and other Asian countries. For example: aluminium extrusions from China, Malaysia and Vietnam; chrome bars from Romania; and quenched and tempered steel plate from Finland, Japan and Sweden. There’s clear float glass from Indonesia, and pineapples from the Philippines. \nSo-called “countervailing duties” are applied to these products to lift their prices to reflect the commission’s estimate of a fair price. \nThese extra taxes are applied to individual manufacturers, and they can be very high. \nFor example, aluminium extrusions imported from four Thai firms have an effective duty rate of 64.4%, according to the Anti-Dumping Commission’s website. \nOn the other hand, the same product from three Vietnamese manufacturers of the same commodity is 5.2%. \nSo what’s next? \nGreat question. \nTrump’s “reciprocal” tariffs are due to come into effect just past midnight on 9 April, Washington DC time. \nBetween now and then countries may be able to negotiate a lower rate by offering Trump what he wants – assuming they know what that is. \nFor now, we will have to wait and see.", "Morning Mail: Trump tariffs trigger Wall Street slump, Liberal candidate’s fringe views, Gen Z’s gender voter divide [2025-04-03T19:46:09Z]": "Morning everyone. Shares on Wall Street and on European bourses have plunged overnight as financial markets flashed a red alert about the global economy in the wake of Donald Trump’s assault on free trade. We have continuing news and analysis for you. \nAt home we have the controversial views of a federal Liberal candidate, continued outback flood peril, and how big is the political divide between young men and women? \nAustralia \n \n Flooded out | The entire population of the tiny Queensland town of Thargomindah has been forced to flee their homes after levee breaks and record flooding eclipsed even the 1974 disaster. \n Fringe views | The Liberal candidate for the NSW seat of Whitlam expressed a string of controversial views on fringe podcasts before his preselection, including the claim that women should not serve in combat positions with the Australian Defence Force. \n Trade beef | The Albanese government has offered $1bn in loans to help Australian exporters after the Trump tariff hit, but it could cost the economy $27bn. After Donald Trump railed about Australian restrictions on American beef, we factcheck his claims and ask what the tariffs mean for our farmers. \n ‘You do not need fixing’ | As the New South Wales ban on gay conversion practices comes into effect today, people in the community express their relief and excitement. \n Threat charge | A Victorian man has been charged for allegedly sending an email to a federal politician in which he threatened to kill them. \n \nWorld \n \n ‘I heard them die’ | A survivor from a massacre of Palestinian paramedics and rescue workers in Gaza has said he saw Israeli troops open fire on a succession of Red Crescent ambulances and rescue vehicles and then use a bulldozer to bury the wreckage in a pit. \n Market meltdown | Global financial markets are in turmoil after Donald Trump’s escalating trade war knocked trillions of dollars off the value of the world’s biggest companies and heightened fears of a US recession. Apple and Nvidia lost a combined total of $470bn by midday New York time. In London, the FTSE100 suffered its worst day for eight months. Economists have been stunned by Trump’s “idiotic” tariffs and the apparently crude way they were calculated. European leaders called the tariffs “fundamentally wrong”, China has condemned “unilateral bullying” and the UK government is preparing retaliatory measures. In Washington, the Democrats slammed the White House for “creating chaos”. Meanwhile JD Vance said Elon Musk would remain a “friend and an adviser” after he leaves his current “Doge” after reports about his future. Follow developments live. \n Insurance risk | The climate crisis is on track to destroy capitalism, a top insurer has warned, due to the vast cost of extreme weather impacts. \n ‘Political’ court | Hungary will leave the International Criminal Court, the prime minister, Viktor Orbán, said as he welcomed his Israeli counterpart, Benjamin Netanhayu – the subject of an ICC arrest warrant – to Budapest. \n Andaman arrest | Indian police said they had arrested a US tourist who snuck on to one of the highly restricted Andaman islands carrying a coconut and a can of Diet Coke to a tribe untouched by the modern world. \n \nFull Story \nNewsroom edition: have vibes replaced policy in this election? \nBridie Jabour talks to the editor, Lenore Taylor, the head of newsroom, Mike Ticher, and the deputy editor Patrick Keneally about holding politicians to account and if voters deserve more from their leaders. \n  \n  \n   \n  \n  \n \nIn-depth \nVoting trends among Gen Zers in the western world point to young men favouring more rightwing parties while young women are leaning more to the left. The divide could have an impact in the federal election, where many of the younger generation will be voting for the first time. Benita Kolovos speaks to some younger voters about the gender divide – “there’s this sort of us v them kind of mentality” says one – while a date-gone-wrong showed Grace Richardson (pictured) that the hill was “much steeper” than she thought. \nNot the news \nThis week’s leading question is posed by a mother who finds her 15-year-old son “filled with attitude, disrespectful behaviour and is just horrid”. She says that she “hates” him and can’t stand to be around him. She asks Eleanor: how can she overcome these feelings? \nSport \n \n Formula One | Max Verstappen was unhappy with the way his Red Bull team sacked their driver, Liam Lawson, after just two races and replaced him with Yuki Tsunoda from sister team Racing Bulls, speaking in the buildup to this weekend’s Japanese Grand Prix. \n Football | Ange Postecoglou’s Spurs team face a stiff test away at Chelsea this morning as he tries to keep the vultures at bay. Follow live. \n Women’s football | The United Kingdom appears certain to host the 2035 Women’s World Cup after Fifa said announced it is the sole bidder, while the 2031 edition is set for the US. \n \nMedia roundup \nThe Trump tariffs could force the Reserve Bank to cut rates four times this year, according to the Financial Review, while The Australian reports the prime minister has ordered the stockpiling of critical minerals in order to beat the impact of the new levies. The Herald Sun explains to Melbourne readers how their commutes will change when the metro tunnel opens this year. People power in Clovelly has saved an ancient fig tree from the chainsaw, the Sydney Morning Herald reports. \nWhat’s happening today \n \n Sydney | Fair work resumes their hearing between the NSW government and hospital psychiatrists. \n Arts | The Dark Mofo winter feast program will be announced at 10am. \n \nSign up \nIf you would like to receive this Morning Mail update to your email inbox every weekday, sign up here, or finish your day with our Afternoon Update newsletter. You can follow the latest in US politics by signing up for This Week in Trumpland. \nBrain teaser \nAnd finally, here are the Guardian’s crosswords to keep you entertained throughout the day. Until tomorrow.  \n \n Quick crossword \n Cryptic crossword \n", "PM falls from stage after speech – as it happened [2025-04-03T06:37:38Z]": " \n  7.37am BST  \n What we learned today, Thursday 3 April \n  \n  Thank you for being with us on yet another whirlwind day on the campaign trail. That’s where we’ll leave things. Here are the main takeaways: \n   \n   Anthony Albanese began day seven of the campaign in Melbourne to tout the government’s “same job, same pay” laws, while Peter Dutton was in Western Australia, announcing $600m for roads critical to mining and agriculture. \n   The day was quickly overshadowed by news Australia had been hit with a 10% tariff on all imports to the US. \n   In response, the prime minister said this was “not the act of a friend” and would have “consequences” for how Australians views the US-Australia relationship. \n   Albanese said his government would not respond with reciprocal tariffs, but would use “every asset” available in talks with the US. He outlined a five-point plan in response. \n   The opposition leader claimed the Coalition would have been able to achieve a different outcome on tariffs – without citing exactly how, and despite the fact no other country in the world was granted an exemption. \n   While being questioned on this, Dutton wouldn’t commit that as prime minister he would be able to get these tariffs removed. \n   The trade minister, Don Farrell, said he would meet with his European counterparts to re-discuss a free trade agreement with the EU. \n   The former prime minister Paul Keating labelled Trump’s sweeping tariff announcement as a “blitzkrieg on globalisation”, saying it represents the “effective death knell of NATO”. \n   The ABC will host the first free-to-air leaders’ debate at 8pm on 16 April with Insiders host David Speers as moderator. \n   \n  Krishani Dhanji will be back with you first thing tomorrow morning for another day of action. Take care, and enjoy your evening. \n  \n Updated at 8.12am BST \n \n \n  7.14am BST  \n  \n  Pocock requests ANU be investigated for potentially misleading Senate \n  The ACT senator David Pocock has requested the Australian National University be investigated for potentially misleading the Senate last year, accusing it of seeming to “hide key information from our community” over a contract with a consulting group. \n  Appearing before the Senate in November last year, Pocock asked the ANU vice-chancellor, Prof Genevieve Bell, if the university had engaged consulting group Nous and if so what the contract was worth. \n  The ANU’s chief operating officer, Jonathan Churchill, said the university had paid “circa $50,000 so far this year”. \n  In a subsequent response to a question on notice from the committee chair, Tony Sheldon, the ANU confirmed the maximum value of the contract, entered into in September 2024, was $837,000, which had subsequently been increased twice to a total of $1,127,000 excluding travel and expenses. \n  Pocock said he was “appalled” the leadership appeared to have shown “such contempt” for the Senate estimates process and “misled” him as a senator. \n   \n   As a measure of how seriously I take this incident, I have written to … Sheldon … requesting an investigation into the matter and potential contempt of the Senate. \n   \n  A spokesperson for ANU said the statement provided by Churchill to the Senate was “factually accurate”: \n   \n   The arrangements with Nous were based on the University’s needs, were subject to regular review, and contained the ability for ANU to exit without committing the full amount of the contract if the University desired. Additional work was identified as required. \n   \n  \n Updated at 8.28am BST \n \n \n  7.00am BST  \n Dutton campaign lands in Busselton, WA \n  \n  Peter Dutton has touched down in Busselton, Western Australia for a brief local visit to the seat of Forrest. We’ve jumped off the plane for a quick press conference just outside the airport. \n  The rain is coming down so this might be a short media appearance. The seat is held by the Coalition MP Nola Marino, who is retiring. Ben Small, formerly a Liberal senator, is running to replace her. \n  Dutton is announcing $16m to upgrade the airport at Busselton here. \n  \n Updated at 8.28am BST \n \n \n  6.58am BST  \n  \n  Shadow trade minister continues Coalition argument it could have achieved different tariff outcome \n  The shadow trade minister, Kevin Hogan, is continuing the Coalition’s argument it would have been able to achieve a different outcome on tariffs for Australia. \n  Speaking on the ABC’s Afternoon Briefing, he argued Mexico and Canada were able to get exemptions and “we know, as a dealmaker, we could have potentially gotten a deal like Canada and Mexico”. \n  Host Patricia Karvelas pointed out that Canada and Mexico were slapped with tariffs, along with the rest of the world, and that cumulatively Australia has had less of an impact. Hogan, though, argued: \n   \n   While we just highlighted where Canada and Mexico did get slapped with tariffs, most goods and services they sell to each other through their FTA’s have been made exempt … And as Arthur just said, Trump is still open to negotiations on these things, we know he’s transactional, leader to leader, so there’s still possibilities to get a better deal. \n   \n  Karvelas also quoted Sinodinos, who said the “Trump administration are determined to have higher tariffs … by minimising exemptions and exceptions”. Hogan continued his argument though, saying: “I think there are examples, like Canada, like Mexico, that have had products made exempt.” \n  So, if Peter Dutton got a phone call with Donald Trump, would he have truly walked away with a deal when no other country did? Hogan didn’t specify how, but still said, “we got a deal previously”. \n   \n   I do agree [with] most of the points you have made. Trump is a believer in tariffs, the people around him believe in this. It is going to be a difficult thing to do, but you have to give it your best shot and I do not think necessarily we have. \n   \n  \n Updated at 8.31am BST \n \n \n  6.48am BST  \n  \n  Sinodinos says he encouraged Americans to approach Australia over differences on beef \n  Arthur Sinodinos said that the Trump administration should have approached Australia when it came to differences on beef, saying: \n   \n   What should have happened here is that Trump administration should have come to the Australian government and said, look, we have certain issues around beef, there is a lack of reciprocity, can we review the way you do things on biosecurity, consistent with your standards, so that we can get greater access? I mean, I encouraged the Americans to do that. We all did. I think that would have been a better way to go than what has happened here. \n   \n  So, the US didn’t do that or did Australia just not respond? The former ambassador said: \n   \n   I think the issue was just let go and let slip and never really properly focused on. The urgent always crowds out the important. \n   \n  In his speech today, Donald Trump singled out Australia’s ban on the import of US beef – imposed in 2003 after the US had cases of bovine spongiform encephalopathy, or mad cow disease. \n   \n    Related: Donald Trump hits Australian exporters with 10% tariffs in ‘liberation day’ speech  \n   \n  \n \n \n  6.44am BST  \n  \n  Former US ambassador says Australia shouldn’t ‘lightly throw away assets like Pine Gap’ \n  On Pine Gap, and whether that should be part of any negotiations with the US to get an exemption, Arthur Sinodinos said it was “rash” for “Australia to put security installations like that on the table”. \n   \n   These things have a value in their own right, [but] they are not pawns in a trade game … If we look like we are prepared to trade with the defence and security relationship in order to get a trade advantage, that is not to a longer term strategic advantage. \n   A longer term strategic advantage is to keep the US locked into this region, by being a strong partner to the US and explaining to them why their tied up with the security of countries like us in the Indo-Pacific. We don’t lightly throw away assets like Pine Gap. \n   \n  \n Updated at 7.01am BST \n \n \n  6.41am BST  \n  \n  ‘Much tougher to get a deal on tariffs this time than 2018’, Sinodinos says \n  Arthur Sinodinos was asked about claims from the opposition leader, Peter Dutton, that he would have somehow been able to achieve a different outcome on tariffs for Australia. \n  (No other country was exempted, and when asked how he would have achieved this at an earlier press conference, Dutton could not answer specifically.) \n  Sinodinos said it would have been “much tougher to get a deal this time around than say in 2018”. \n   \n   The Trump administration are determined to have higher tariffs. They believe that will generate revenue, they want the protective effect, and they believe they get that by minimising exemptions and exceptions. \n   But as usual with the president, he is leaving the door open. We will see what that means in terms of potential negotiations of individual country deals, but it is a hard environment for any country to get an exception here in the US at the moment. \n   \n  \n Updated at 6.44am BST \n \n \n  6.37am BST  \n  \n  Former ambassador to the US weighs in on further tariffs \n  Former Liberal senator and ambassador to the US Arthur Sinodinos is up on ABC Afternoon Briefing to weigh in on the latest tariffs. \n  He said it was true Australia “didn’t cop it much as many other countries,” but argued the broader impact was relevant: \n   \n   What we have to be concerned about is that there will be retaliation, potentially by the major blocks – like the EU as well as the Chinese and others – and what does this mean about global trade and investment? \n   We are successful trading nation, we rely on trade, so we are in a situation now where I think we’re going be buffeted by some very choppy waters and a lot of uncertainty in global business tonight about how they’re going to handle these tariffs. \n   \n  Sinodinos said that whoever is elected prime minister should “come to the US pretty quickly and eyeball the president”, and have a “leader to leader” conversation on this. \n  \n Updated at 6.45am BST \n \n \n  6.31am BST  \n  \n  Man charged with intimidation after alleged antisemitic comments \n  A man has been charged with intimidation after an alleged antisemitic incident in Sydney earlier this year. \n  NSW police said they have been investigating reports of antisemitic comments directed at a Kogarah hospital staff member in a lift on 28 February. \n  Officers arrested a 24-year-old man in Arncliffe this morning, who was taken to St George police station and charged with stalking and intimidation, and possessing violent extremist material. \n  He was refused bail to appear in Sutherland local court today. \n  Police said two mobile phones have been taken for further examination, after being seized when a search warrant was executed at premises in Arncliffe. \n  \n Updated at 6.34am BST \n \n \n  6.24am BST  \n  \n  Wong responds to Keating’s suggestion that Trump tariffs signal end of NATO \n  Wrapping up the interview, Penny Wong was asked about comments from former PM Paul Keating that Donald Trump’s tariff announcement “represents the effective death knell of NATO”. \n  She said the government’s job was to “continue to seek strategic stability,” including Australia’s strategic partnership with the US and Aukus. \n   \n   In relation to Nato, I think it is important to remember Nato is a very important contributor to global peace and stability. There is no doubt we live in an uncertain world … a world where we see more conflict and frankly more division. Our job, from Australia’s perspective, is to be a voice for continued engagement, continued strategic stability, because that underpins peace. \n   \n  Are those institutions still in good health? Wong answered: \n   \n   I do not believe suggesting that they are ending is in Australia’s interest. \n   \n  \n Updated at 6.26am BST \n \n \n  6.20am BST  \n  \n  Wong says direct negotiation over tariffs preferable to WTO \n  Asked about whether Australia might take the US to the World Trade Organization over the latest tariffs, Penny Wong said the government’s preference was to negotiate directly: \n   \n   We have dispute resolution mechanisms available to us, both within the free-trade agreement and at the WTO. Our preference is to negotiate directly and to try to resolve this. That is what would like to do and what the government will be doing certainly if we are re-elected. \n   \n  \n \n \n  6.19am BST  \n  \n  Should Australia revisit its restriction on US beef? \n  Penny Wong said Australia’s biosecurity decisions should be guided by science: \n   \n   I want science the guide that process, it’s important for Australia and our industries and for our reputation that we ensure that our biosecurity is scientifically based. \n   \n  Is the science still saying we must have this restrictions? Wong suggested it is: \n   \n   As I understand – it is obviously not my portfolio – that process is not yet finalised to the extent that that position could be changed, and we certainly don’t propose to be compromising our bio security regime. \n   \n  \n \n \n  6.17am BST  \n  \n  Wong says reciprocal tariffs would put costs on Australian consumers \n  Does Penny Wong think Australia can live with a 10% tariff, because getting out of it might be too costly for our country? \n  She told host Patricia Karlevas that “I don’t agree with how you have put that”. \n   \n   Let’s remember tariffs are paid by the US consumer, ultimately. That is where the cost of tariffs fall. That is why we are not going down the path of reciprocal tariffs – that is putting Australian tariffs on because we know that would be making Australian consumers pay the price of this difference of views on a trade. \n   \n  Wong said Australia would “continue to put our view very clearly” to the US and “diversify our economic relationships”. \n  \n Updated at 6.21am BST \n \n \n  6.14am BST  \n  \n  Wong says defence relationship with US important ‘regardless of disagreements on economic policy’ \n  Asked about Australia’s defence relationship with the US amid the tariff announcements, and whether Pine Gap should play a role in any negotiations, Penny Wong responded: \n   \n   I think it’s very important that we continue to preserve and protect our strategic relationship and our institutional relationship with the United States. \n   \n  The foreign affairs minister said she was “surprised that Peter Dutton would be so reckless as to suggest a different approach.” \n   \n   We think it is important to remember the US administration, regardless of our disagreements on economic policy, we have a very important strategic relationship with them and we have had for decades. We have a very important relationship when it comes to Aukus and we are pleased with the continued and bipartisan support for Aukus. \n   \n  \n Updated at 6.20am BST \n \n \n  6.10am BST  \n  \n  Wong says Dutton ‘so arrogant as to be delusional’ with claims he could have achieved different tariff outcome \n  The foreign affairs minister, Penny Wong, says that “no country is in a better position than Australia” after today’s tariff announcements from the United States. \n  Speaking with ABC’s Afternoon Briefing just now, she said: \n   \n   As the prime minister has made clear, we believe these tariffs are unwarranted – certainly inconsistent with the free trade agreement – and they go against the spirit of the friendship between our two countries. \n   \n  But Wong said that “unlike [Peter] Dutton, we don’t want a deal at any cost”, and took aim at him as being “so arrogant as to be delusional”. \n   \n   He seriously thinks he uniquely, amongst all leaders in the world, could have got a better deal. The reality is this is the decision president Trump and his administration have made. It is central to their political and economic strategy. We disagree with it for the reasons the prime minister has outlined. \n   \n  \n Updated at 6.16am BST \n \n \n  5.58am BST  \n  \n  Impact on American consumers from Trump’s tariffs \n  As the rest of the world chews on the bitter tariff stew served up this morning, spare a thought for American households – the very ones Trump is claiming he’s there to “make wealthy again”. \n  The average American will be $US3,800 ($6,000) worse off this year thanks to Trump’s tariff policies, according to Yale University’s recently created thinktank, The Budget Lab. \n  The poorest Americans will be hit the hardest in the short-term as taxes on imports push prices higher. \n  Clothing costs are anticipated to soar by 17%. The lowest income households will suffer a 4% drop in disposable income, versus a 1.6% drop for the wealthiest. \n    \n    \n     \n    \n    \n   \n  The US’s average effective tariff rate will reach 22.5% thanks to “liberation day”, or the highest since 1909, according to the new analysis. \n  The American economy will be nearly 1% smaller in 2025 thanks to the accumulated levies announced since Trump came to power, and most of that prospective damage is thanks to what was revealed today. \n  And US GDP will be permanently lower by 0.4%. \n  Before we feel too sorry for the US, its northern neighbour, Canada, will fare far worse: its economy will be 2% smaller in the long run. \n  \n Updated at 6.01am BST \n \n \n  5.52am BST  \n  \n  Murray Watt dismisses Dutton’s IR climbdown \n  The workplace relations minister, Murray Watt, has just responded to news Peter Dutton has ruled out repealing “same job, same pay” laws.  \n  Speaking to reporters after Anthony Albanese’s speech to the Mining and Energy Union conference, Watt said: \n   \n   If you believe Peter Dutton on ‘same job, same pay’, I’ve got a mine shaft to sell you. Peter Dutton and his colleagues voted against the ‘same job, same pay’ laws. They called it at the time unAustralian and dangerous, they said the laws would close down Australia.  \n   Does anyone really believe they are going to change position from that to all of a sudden start reporting it? \n   \n  \n \n \n  5.46am BST  \n AEC says Abbie Chatfield podcasts did not breach electoral rules \n  \n  The Australian Electoral Commission has cleared podcast host Abbie Chatfield of any wrongdoing and said a review of her content has found it “does not require an authorisation statement”. \n  Liberal senators had raised concerns about some of the podcaster’s podcasts and material shared on social media, questioning whether it should have been classed as electoral material, which would require an official authorisation statement. \n  Anthony Albanese and Adam Bandt have both appeared on Chatfield’s podcast in recent weeks. Clips of the interviews were shared on both politician’s social media accounts. Chatfield has separately encouraged her followers to put the Liberal party last on ballot papers. \n  In a statement, an AEC spokesperson said that while the podcasts “could be viewed as being made for purpose of influencing how someone casts their vote, there is no evidence that there was a monetary benefit for the podcaster as a result of either Albanese or Bandt being invited onto the show”. \n   \n   It appears that the invitations to Albanese or Bandt to participate were voluntary. In addition, questions put to both interviewees were sourced from the podcast’s audience. There is no evidence that either Albanese or Bandt had creative control in relation to the questions that were asked. \n   As such, the AEC is not satisfied that the episodes of Ms Chatfield’s podcasts on 21 February 2025 and 11 March 2025 could be considered to be paid advertising or to be communicated by or on behalf of a candidate or party. This content does not require an authorisation. \n   The AEC is making the outcome of this review public out of fairness to Ms Chatfield given the media coverage of the issue to date. \n   \n  \n Updated at 5.50am BST \n \n \n  5.44am BST  \n Albanese tumbles on stage after giving speech in Newcastle \n  \n  Just back to Anthony Albanese’s speech at the Mining and Energy Union conference in the Hunter this afternoon: \n  After delivering the speech, Albanese appeared to stumble on stage, prompting gasps from the union members gathered in the room. He quickly recovered and appears OK. \n  He was also asked about this on ABC Newcastle radio just now, and said: \n   \n   I stepped back one step. I didn’t fall off the stage … Just one leg went down, but I was sweet. \n   \n   \n    \n   \n  \n Updated at 8.07am BST \n \n \n  5.41am BST  \n  \n  PM on fast rail between Newcastle and Sydney: ‘We’re going through the business case’ \n  Asked if there will there be money in the campaign for fast rail between Newcastle and Sydney, Anthony Albanese said that work was under way. \n   \n   We’ve already begun that process. We’ve established the office in Newcastle here. We think it’s an exciting proposal. I’ve been a long term supporter of it. The work is being undertaken as we speak, and we’ve already provided funding in the budget. \n   \n  In terms of how soon the high-speed rail could be in place, the prime minister didn’t specify, answering: \n   \n   We’re going through the business case and going through those processes. \n   \n  \n Updated at 5.46am BST \n \n \n  5.38am BST  \n  \n  Albanese responds to climate protestors who crashed his press conference \n  Anthony Albanese also weighed in on the climate protestors that crashed his press conference in Maitland today, and said: \n   \n   I think that people screaming in a hospital ward says more about them than advancing their cause. Frankly, I thought it’s [an] entirely inappropriate setting for a couple of people to pose as journalists … \n   \n  \n Updated at 5.39am BST \n \n \n  5.36am BST  \n  \n  Albanese speaks to local radio in Newcastle about job transition for mining workers \n  The prime minister, Anthony Albanese, is speaking with ABC Newcastle this afternoon, declaring he “certainly” still sees the Hunter as a Labor heartland. \n  Asked if he has lost track with local voters, with a number of local seats considered marginal, Albanese disagreed: \n   \n   Of course, Newcastle … [has] been represented by the Liberal party at various times. And when people have done that, they’ve come back to Labor pretty quickly, because it’s only Labor that will stand up for values. \n   \n  He was also asked about community concern over the closure of coal mines and the transition for workers, and pointed to the net zero authority “to make sure that communities aren’t left behind”. \n   \n   They’ll help by making sure that we have new jobs created, in addition to support for existing jobs that will be around for some time – but we want new industries to come to the Hunter. \n   \n  \n Updated at 5.37am BST \n \n \n  5.31am BST  \n  \n  Good afternoon! Emily Wind here, I’ll be taking you through the rest of today’s news. \n  \n \n \n  5.29am BST  \n  \n  That’s it from me today, thank you for following me along on the blog. \n  It’s been a huge day, with plenty of reaction to Trump’s announcement on tariffs, and the fabulous Emily Wind will be able to bring you all the rest on that issue and what’s happening on the election trail this afternoon. \n  I’ll catch you all bright and early tomorrow morning! \n  \n Updated at 5.30am BST \n \n \n  5.05am BST  \n  \n  ‘Same job, same pay’ laws on ballot at election, Albanese says \n  Anthony Albanese is delivering a speech about Labor’s “same job, same pay” laws to a Mining and Energy Union conference in the seat of Hunter, the heart of NSW coal country. \n  For those unfamiliar, the laws came into force last year allowing labour-hire workers to apply to be paid the same amount as directly employed staff doing the same job. \n  Unions in industries including mining and aviation are already capitalising on the new bargaining tool to negotiate pay rises for their workers. \n  The Coalition opposed the laws in federal parliament and vowed to review them if it won election. \n  The opposition leader, Peter Dutton, seemingly walked back that position on Thursday after responding “we’re not going to” when asked if a Coalition government would reverse the legislation. \n  In his speech to the union conference (almost certainly written before Dutton’s comments), Albanese said the laws were “on the ballot paper” at the 3 May federal election. \n   \n   They are promising to abolish Same Job, Same Pay. To take away all those pay rises that workers have earned. Ripping money out of people’s pockets – and out of communities. Whether it’s your Medicare, your wages or your conditions …. \n   \n  Albanese entered the packed conference room to a standing ovation from union members, before posing for a selfie with the Hunter MP, Dan Repacholi. \n  A report from progressive think tank the McKell Institute, published on Thursday, estimated the “same job, same pay” laws would deliver a wages boost of up to $920.3m each year to workers in industries such as mining, aviation and retail. \n  \n Updated at 5.09am BST \n \n \n  4.53am BST  \n  \n  Uninhabited islands tariffed \n  If you also thought it was a little strange that Norfolk Island (a tiny island that is part of Australian territory) had been included in Trump’s tariffs, well the uninhabited Heard and McDonald Islands have also been captured. \n  How? Why? Kate Lyons and Nick Evershed have the details here: \n   \n    Related: Trump imposes tariffs on uninhabited Heard and McDonald Islands near Antarctica  \n   \n  \n Updated at 5.06am BST \n \n \n  4.36am BST  \n Kim Williams: ‘No doubt’ Coalition government would initiate review of ABC \n  \n  Jumping out of the campaign and back to Kim Williams at the Melbourne Press Club … \n  Williams has responded to comments made by Peter Dutton this week where he refused to rule out cuts to the ABC, saying the public broadcaster would need to demonstrate efficiency and excellence: \n  Williams says a “well-resourced ABC has never been more important”: \n   \n   I don’t think the ABC has anything to apologise for in its continuing quest for excellence and its continuing obligation to operate with efficiency. \n   \n  Asked if he believes a Coalition government would initiate a review of the ABC, Williams replies: “no doubt about it”. \n  \n Updated at 5.11am BST \n \n \n  4.27am BST  \n Rising Tide protest group claims responsibility for crashing PM’s press conference \n  \n  Climate action group Rising Tide says it was its protesters who crashed Anthony Albanese’s media conference a short time ago. \n  The group started in Newcastle, NSW, around the Hunter region, and have been pushing to end all coal exports from Newcastle by 2030. \n  Rising Tide activists have also recently crashed the press conferences of Peter Dutton, Angus Taylor and Jim Chalmers. \n  \n Updated at 5.16am BST \n \n \n  4.15am BST  \n  \n  ABC chair becomes emotional after reading viewer messages on Alfred coverage \n  Williams has become emotional after reading messages from ABC viewers expressing gratitude for the public broadcaster’s coverage of the ex-Tropical Cyclone Alfred last month. \n  Williams became teary and said he could read these messages “for hours”, prompting applause from the audience at the Melbourne Press Club: \n   \n   What we do as members of the media is more than a public service. It’s something inseparable from the workings of the nation. \n   We need an extremely strong and well funded media. We need an extremely strong and well funded ABC.” \n   \n  \n Updated at 4.50am BST \n \n \n  4.13am BST  \n  \n  ABC chair tells Melbourne Press Club investment in broadcaster is ‘supporting Australian democracy’ \n  ABC chair Kim Williams is addressing the Melbourne Press Club to mark his first 12 months as chair. His appearance comes the day after the opposition leader, Peter Dutton, hinted he may cut funding to the ABC if it was not efficient or excellent enough. \n  Williams is making a case for supporting the ABC in the interests of democracy, saying the ABC can provide trustworthy independent journalism in the face of a global assault on truth. \n   \n   One direct way of supporting Australian democracy is before our very nose – to properly invest in the ABC. \n   We perform as well as we can with the allocations provided, and we are grateful to the Australian government for providing it to enable the ABC to serve audiences. \n   \n  \n Updated at 4.43am BST \n \n \n  4.09am BST  \n PM’s media conference crashed by climate protesters \n  \n  A touch earlier, the PM did a quick press conference as well, in the NSW Hunter region, where he was talking up the government’s promise for more Medicare urgent care clinics. \n  Albanese was asked to respond to Peter Dutton’s reaction to the tariffs and said: \n   \n   Peter Dutton doesn’t have any plans, [his] plan is to move into Kirribilli House to measure up the curtains. What we’ve done is to stand up for Australian interests. \n   \n  But two climate protesters crashed that media conference as the PM was talking about supporting the region and its coal industry: \n   \n   We want to make sure as the transition happens – we have established a net zero authority – what that’s about is making sure no community gets left behind. We support the coal industry. \n   \n  The protesters yelled “Mr Albanese, why did your government approve 33 new fossil fuel projects?” \n   \n   It’s my future, it has to stop. \n   \n  The protesters were quickly ushered out of the building by security. \n  \n Updated at 4.37am BST \n \n \n  3.57am BST  \n  \n  Dutton pressed on how he would negotiate tariffs with US \n  Dutton is tested again on what exactly he would put on the table in negotiations with the Trump administration. \n  One reporter asks whether Australians even want a fight with the US? Dutton replies: \n   \n   Well, you bet that we’re going to get the best deal for our country, and we can do that through strong leadership. \n   \n  He’s asked whether a Dutton government would be willing to withhold assets or from the US, but Dutton says his approach would be the “opposite”. \n   \n   It’s about what we can bring to the table in a bigger deal with the United States. I think there is opportunity for us to take what is a bad decision, and decision I’m dead against, that’s been made by the president. \n   There’s huge market opportunity in the US, the critical mineral development out of WA can supply the US supply chain, and we can have assurances, because we’re a trusted partner, there is enormous opportunity. But the prime minister hasn’t spoken about any of that to President Trump … \n   \n  Again, the Albanese has said that the government did negotiate with the Trump administration on critical minerals after the first set of tariffs on steel and aluminium were announced. (You can recap that here). \n  Dutton is asked point blank by another reporter if there is a “stick” that can be used against the US. \n  He doesn’t directly answer the question, he just says the US “value the relationship we have with them”. \n  \n Updated at 4.23am BST \n \n \n  3.49am BST  \n  \n  Dutton claims Labor delaying North West Shelf gas decision \n  Peter Dutton is speaking to media again from Perth, and he’s pushing hard on mining (specifically that the Coalition heavily supports the mining industry). \n  Dutton has accused Labor of delaying a decision on the extension of the North West Shelf gas project in WA. \n   \n   I think what it says to everybody in WA who is reliant on or connected with this sector, with this incredible mining sector, that you can’t trust Mr Albanese, and he certainly can’t trust a minority Labor-Greens government. \n   \n  The first question to Dutton goes to whether a Coalition government would repeal the same job, same pay IR laws that the Labor government has put in. \n  Dutton says they won’t and then goes to what he’s said previously on IR, that he’ll deregister the construction union, the CFMEU, which is under administration. \n   \n   We’re not going to. And we’ve said right from the start the big difference on industrial relations policy at the next election between us and the Labor Party will be that we’re going to deregister the CFMEU. The CFMEU would be a disaster for the Pilbara. The CFMEU would be a disaster across every mining site. \n   \n  \n Updated at 5.09am BST \n \n \n  3.41am BST  \n Wong dismisses Dutton over ‘captain obvious’ suggestions for tariff response \n  \n  The foreign minister, Penny Wong, says the US administration’s tariffs are a “poor decision”. \n  Wong is asked on Sky News to respond to Peter Dutton’s suggestion that there is a pathway to resolving the issues if there’s a “will”. \n  Wong calls Dutton “captain obvious”, suggesting the government is doing everything he’s pointed out already, and called him “reckless”. \n   \n   Peter Dutton seems to think he’s Superman, but he’s actually Captain Obvious. He suggests that this is a time for negotiation, well, that is what we have been doing. He suggests we should be discussing critical minerals, I’m sure he will recall it’s quite been quite public, that is, that is what we have been doing … \n   But really, what we saw from Mr Dutton today is more reckless arrogance. We saw him today talking down Australia. \n   \n  Wong says, as she mentioned during her press conference with the prime minister, that this is a time for unity across politics, and warns Dutton to “stop his relentless carping”. \n  \n Updated at 3.58am BST \n \n \n  3.25am BST  \n  \n  Peter Dutton’s WA tour continues, arriving at a manufacturing business in the Perth electorate of Hasluck. He’s checking out a factory and warehouse which makes drilling equipment.  \n  He’s already done his main press conference for the day, so we’re expecting him to do a tour as a photo opportunity, and then to make some remarks - launching the Coalition’s $600 million pledge on road infrastructure for mining and agriculture areas.  \n  Hasluck is held by Labor on a 10% margin, so not necessarily at the top of the “at risk” column for Anthony Albanese - but Dutton needs to make some serious inroads in the west, so he’s shooting high with some ambitious visits.  \n  \n \n \n  3.18am BST  \n  \n  Queensland doesn’t look like it’ll adopt a gas reserve policy - instead trusting in rolling out more supply.  \n  Mount Isa-based MP Robbie Katter asked if the LNP state government was considering following Peter Dutton’s lead in question time this morning.  \n  “Without it, Phosphate Hill, Mount Isa mine and the town’s refinery are all at risk,” he said. \n   \n    Related: Is Dutton’s gas plan just hot air? - podcast  \n   \n  Minister for natural resources Dale Last didn’t answer that question, but he did make it clear he wants the industry in Queensland to expand.  \n   \n   We have ample gas reserves, ample gas supplies. And as I’ve been saying to my gas companies in this state - I’ll sign, you drill. And that’s a message that we’re taking out across Queensland to develop our gas reserves, to bring them online, because that is prosperity for Queensland, and that is jobs for Queensland. \n   \n  Last cited the Australian market supply condition process and the Australian domestic gas security mechanism, which require more gas to be used locally.  \n  He went on to say that “there’s no gas crisis in this state”.  \n  \n \n \n  3.13am BST  \n  \n  PM heads to Paterson \n  After landing in the NSW Hunter region, Anthony Albanese has made a beeline for the electorate of Paterson. \n  Labor backbencher Meryl Swanson holds the seat on a margin of 2.6% but faces a serious threat from the Liberals, who believe it is winnable in part because of community unrest over a proposed offshore wind zone in Port Stephens. \n  Albanese will visit Maitland hospital to spruik his promise to build a new Medicare urgent care clinic in the region to take pressure of the hospital’s emergency department. \n  \n Updated at 3.50am BST \n \n \n  3.09am BST  \n  \n  Voting for Dutton is voting for higher taxes – Leigh \n  Finally, Leigh also argues that a vote for Peter Dutton is a vote for higher taxes (as the PM and Treasurer have also been pushing): \n   \n   Peter Dutton has pledged to repeal Labor’s tax cuts – the very ones that deliver for the middle of the income distribution. If that happens, every Australian taxpayer will face a higher tax bill. These aren’t theoretical risks. They are practical, immediate consequences – and they fall hardest on the people who deserve relief the most. \n   It would be, quite literally, the first time in living memory that a federal opposition promised to raise taxes on everyone. \n   The reforms we’ve introduced aren’t ideological. They’re practical. Measured. Grounded in evidence. And, perhaps most importantly, designed not just for the world we model, but for the one Australians wake up in each day. \n   Fair tax policy isn’t just about getting the incentives right. It’s about getting the priorities right. And this reform puts the middle of the income distribution back at the centre of the conversation. \n   \n  \n Updated at 3.50am BST \n \n \n  3.05am BST  \n  \n  Continuing from our last post … \n  Leigh has also presented new analysis on how the tax cut will help women. He says: \n   \n   The majority of low- and middle-income earners in Australia are women. They’re also more likely to be in part-time or casual work, and more affected by the interplay between tax, family payments, and childcare costs. \n   Under these changes, around 90% of women taxpayers – 6.3 million women – will receive a larger tax cut than under Morrison’s Missing Middle Model. For those women getting a larger tax cut, the average increase in their tax benefit is $1,181. That’s not just a spreadsheet improvement. That’s more money for rent, groceries, bills and maybe a bit left over at the end of the fortnight. \n   Treasury estimates that the combined effect of the tax cuts will increase total hours worked by about 1.3 million per week. 900,000 of those hours are expected to come from women. That’s the equivalent of unlocking more than 20,000 full-time roles – empowering people to work more if they choose to. \n   \n  \n Updated at 3.28am BST \n \n \n  3.04am BST  \n  \n  Andrew Leigh spruiks benefits of stage-three tax cut changes \n  The assistant minister for competition, charities &amp; treasury, Andrew Leigh, has made a case for how the government’s stage-three tax cuts have made Australian society more equitable. \n  Speaking at Melbourne University’s conference on Justice and the Tax Base in the 21st Century, Leigh said: \n   \n   The Albanese government has introduced three rounds of income tax cuts. Each has been guided by the belief that a just tax system should reward effort, support those doing it tough, and help grow the economy without eroding the social contract. \n   \n  Making the case for income tax, he said: “When it works well, it makes the country stronger, fairer, and more cohesive.” \n  He said Labor’s changes to the stage-three tax cuts helped more middle- and lower-income Australians: \n   \n   The second and third rounds go further by lowering the first marginal rate – currently 16% for income between $18,201 and $45,000. \n   From 1 July 2026, it drops to 15%. From 1 July 2027, it drops again to 14% – the lowest this rate has been in more than 50 years. For context, the last time it was this low, the original Mad Max was in cinemas and ABBA was still touring. \n   These tax cuts are steady, deliberate, and designed to reinforce progressivity while boosting after-tax incomes in a fiscally responsible way. \n   Consider someone on average earnings – around $79,000. In 2026–27, they’ll receive a new tax cut of $268, increasing to $536 from 2027–28. \n   \n  \n Updated at 3.20am BST \n \n \n  2.48am BST  \n  \n  ‘Today is a dark day in the global economy’, says Chalmers  \n  Chalmers hasn’t yet spoken on Peter Dutton’s claims he could have achieved a better or different outcome, but he says now’s not the time for Dutton’s “higher taxes” and “lower wages”. \n   \n   Peter Dutton’s response to higher tariffs around the world is higher income taxes for every Australian worker … \n   Today is a dark day in the global economy. Australia has a plan to respond to this global economic uncertainty, the plan in the budget and the additional steps announced by the prime minister today. We are not uniquely impacted, but we are uniquely placed and we are well prepared for whatever comes at us from around the world. \n   \n  The government has continued to reiterate the point that all countries have been affected by these tariffs, and there have been no carve-outs or exemptions negotiated with the Trump administration. \n  \n Updated at 2.51am BST \n \n \n  2.44am BST  \n  \n  Chalmers asks Treasury department for new modelling on tariff impact \n  The treasurer, Jim Chalmers, is also digging into the US’ decision to apply sweeping tariffs and says he’s asked the treasury department to update modelling on the impact these tariffs will have. \n  Chalmers says he’ll release that modelling publicly. \n   \n   These escalating trade tensions, these tariffs announced by the Trump administration in Washington DC, are self-defeating, they are self-sabotaging, and in a time when there’s not a lot of growth in the global economy … \n   We know that we won’t be immune from these tariffs, even though the US is only about 5% of our export market. We know that Australia, like other countries, that we are not uniquely impacted by these tariffs, but we are uniquely placed and we are very well prepared. \n   \n  Chalmers, like the PM, says Australia will continue to diversify its trade portfolio, and not engage in “a race to the bottom” on tariffs. \n  \n Updated at 2.54am BST \n \n \n  2.35am BST  \n  \n  ABC announces ‘gimmick-free’ debate between Dutton and Albanese \n  The ABC will host the first free-to-air leaders’ debate at 8pm on 16 April with Insiders host David Speers as moderator.The leaders, Anthony Albanese and Peter Dutton, will make opening and closing statements and will have equal time to respond to questions. The topics and questions will be decided by the ABC. \n  Speers said: \n   \n   This will be a gimmick-free debate, focused on the major challenges facing Australia at a critical time, and where the two leaders stand \n   The aim is to give voters an opportunity to hear the Prime Minister and Opposition Leader discuss their competing visions for the country and genuinely debate each other. \n   My commitment is to give both leaders fair treatment and an opportunity to make their case. \n   \n  The debate will be broadcast live on the ABC and ABC iview, and will also be available across ABC Local Radio, Radio National, ABC News Radio and on the ABC listen app. \n  \n Updated at 2.43am BST \n \n \n  2.28am BST  \n  \n  The press plane following Albanese has just touched down in Newcastle.  \n  As soon as we have details on the prime minister’s next stop, we’ll let you know!  \n  \n \n \n  2.24am BST  \n Former PM says US tariff policy a ‘blitzkrieg on globalisation’ \n  \n  Former Australian prime minister Paul Keating has weighed into Trump’s sweeping tariffs announcement, calling it Trump’s “blitzkrieg on globalisation” and saying it represents the “effective death knell of NATO”. \n  Keating says Trump’s “neo-Munroeism” shows the US will now only focus on the western hemisphere, and change the world’s geo-strategic settings. \n  In a statement, he wrote: \n   \n   Trump’s new economic fortress America, by its design, winds off its principal economic and strategic partner, Europe, leaving China as the sole promoter of free and open international trade… \n   The announcement represents the effective death knell of NATO, a severing that will inform all other allied relationships with America including Anzus with Australia. \n   \n  Keating warns if the announcement spells the end of Nato, then what will continue to underpin the Anzus treaty. \n   \n   Australia’s clutch of Austral-Americans, that phalanx of American acolytes, must have choked on their breakfasts, as Donald Trump laid out his blitzkrieg on globalisation, with all its implications for the rupture of cooperation and goodwill among nations. \n   \n  \n Updated at 2.30am BST \n \n \n  2.15am BST  \n  \n  A closer look at Dutton’s claims about achiving different tariff outcome  \n  Peter Dutton very strongly implied there that he would have achieved a different and a better outcome than Anthony Albanese (and every other country in the world). \n  Several times over that press conference he said there could have been a better outcome: \n   \n   There is a deal to be done here if the prime minister had the strength of leadership and ability to do it. He hasn’t even spoken about the defence element to the relationship. It’s the most integral part of our relationship with the United States. We could have leveraged a better outcome if we’d been speaking about this from January 20. \n   \n   \n   We have the ability to manage the economy, the ability to manage our national security needs and we have an ability to make sure that we can get a better deal for Australia, which is what we would do. \n   \n   \n   We’re not trading anything away. We want to enhance the relationship and I believe we’re the only alternative at this election that can achieve a better outcome. \n   \n  But Dutton would not lay out exactly how he would get that “better outcome”. \n  He said several times he wasn’t willing to punish the US through our defence alliance, like pulling US troops out of the Northern Territory. Sky’s Andrew Clennell accused Dutton of sounding as if he’s “kowtowing” to the Trump administration by just offering more to the Americans. \n  He also said there could be a deal on critical minerals, when the government had previously tried that – only to be rejected by the Trump administration. \n  \n Updated at 2.18am BST \n \n \n  2.02am BST  \n  \n  Dutton’s claims of achieving a different tariff outcome challenged \n  Reporters are asking Dutton what exactly he would put on the table to achieve a different outcome with the US. \n  Dutton highlights critical minerals as a bargaining chip, and accuses the PM of not having “spoken a word about it”. (Albanese and Farrell previously said after the first tariffs were put in place on aluminium and steel that they had tried to negotiate on critical minerals but the US administration hadn’t accepted it.) \n  Dutton also says that he won’t consider pulling on any of the levers of the Aukus agreement, or pulling US troops out of Darwin. \n   \n   We’re not trading anything away. We want to enhance the relationship and I believe we’re the only alternative at this election that can achieve a better outcome. \n   \n  But he also won’t commit that as prime minister, he would have been able to get these tariffs removed. \n   \n   What I offer to the Australian people, my team offers stability and proven performance. We have the ability to manage the economy, the ability to manage our national security needs. \n   \n  \n Updated at 2.14am BST \n \n \n  1.53am BST  \n  \n  On a different matter, Dutton is asked why after an interview yesterday his transcript was edited. \n  Dutton had joked about the noise made by the Collins class submarines, and he said “you can hear them rattling down the coast”. \n  Dutton says that shouldn’t have been edited out. \n   \n   I haven’t seen the transcript. It shouldn’t be edited out. It was a jovial conversation with Mick Molloy, as you would expect. I’ve been very clear and if you look at the transcript, and what I’ve said otherwise in relation to Collins class, they are best in class but they run out of work in the late 2030s, early 2040s, which is why the government’s inability to provide the upgrade is an outrage. \n   \n  \n Updated at 1.58am BST \n \n \n  1.51am BST  \n Coalition ‘could have achieved a different outcome’ on tariffs, suggests Dutton \n  \n  Dutton is asked about whether Australia sitting lowest on the lowest run of these tariffs for anyone in the globe is a victory. \n  The opposition leader replies that the PM didn’t know about the tariffs until it was announced in the media. \n   \n   The prime minister didn’t know anything about it. It was first made known to him when it was publicly announced. So that talks about the influence that the prime minister has in relation to this matter. \n   There needs to be proper negotiation and consultation. 10% is a significant impost and it may not be the 26% that other countries have faced but I can tell you this. Jobs will be lost and there will be economic detriment to our country. \n   \n  Would Dutton have been able to produce a different outcome? \n   \n   I do believe that we could have achieved a different outcome. \n   \n  This would be the only better deal of all countries in the world – no countries were given an exemption. \n  \n Updated at 2.03am BST \n \n \n  1.44am BST  \n  \n  Dutton ‘strongly supports’ government’s tariff response \n  The Coalition supports the five measures the government has announced in response to the tariffs, but there are some caveats. \n  Dutton says he “strongly supports” strengthening the anti-dumping commission, and the $50m to help industries export to new markets. \n  He also strongly supports the government’s buy Australia plan, and prioritising Australian products and industries for government procurement. \n  Dutton says they also support the $1bn economic resilience program but said it should be administered through the export finance Australia organisation, and not the national reconstruction fund. \n  The coalition also says “there’s an arrangement to be arrived at” on establishing a strategic reserve of critical minerals. \n  Dutton says: \n   \n   We’ve been working on this but it is something the government can resolve, I think, very quickly, with the administration. We need to do that for our beef producers and for every industry here and to protect jobs in Australia, we need this sorted out as quickly as possible and that’s exactly what we’re dedicated to do. \n   \n  \n Updated at 2.17am BST \n \n \n  1.37am BST  \n  \n  Dutton calls on Albanese to ‘get the relationship normalised’ with US \n  Dutton believes a deal can be “done very quickly” and says the PM must do everything he can to do that. \n  Albanese said earlier that there have been ongoing discussions and negotiations with the US administration. \n  Dutton reiterates his point that the PM hasn’t been able to speak to Trump again. \n   \n   We have an opportunity … to start negotiations with the United States straight away. I think there can be a deal done very quickly with the administration and I think it’s important the prime minister apply himself to that immediately. \n   The prime minister hasn’t been able to get a call or a meeting with president Trump, but that needs to change and he needs to do everything he can to leverage the ambassador and others to get the relationship normalised. \n   It’s obvious that the prime minister didn’t know anything about this announcement until it was actually released to the press. \n   \n  Dutton says Australia has the Aukus deal and the Anzus treaty, as well as stores of critical minerals, which are a “natural point of leverage” in the relationship with the US. \n  \n Updated at 1.44am BST \n \n \n  1.33am BST  \n  \n  ‘This is a bad day’ for Australia, says Dutton.  \n  Peter Dutton is responding to the tariff announcement, speaking this morning from Perth. \n  Dutton says he’s spoken to beef producers this morning, and says they’re in negotiations with their counterparts in the US. \n   \n   I think this is a bad day for our country and it’s not the treatment that Australians deserve, because we have a very trusted, longstanding and abiding relationship with the United States. \n   I want to make sure that we can help our beef-producers, make sure that we can help our manufacturers, grow our industry and increase employment in this country and we can do that through a normalised relationship in a trading sense with the United States and obviously to expand other markets, which is exactly what a Coalition government does. \n   \n  \n Updated at 1.36am BST \n \n \n  1.30am BST  \n  \n  Dutton about to speak to reporters in Perth \n  The opposition leader, Peter Dutton, is due to front the media any minute now to respond to this morning’s tariff announcements. Stay tuned. \n  Meanwhile, here is what we know so far: \n   \n    Related: Donald Trump hits Australian exporters with 10% tariffs in ‘liberation day’ speech  \n   \n  \n Updated at 1.30am BST \n \n \n  1.26am BST  \n  \n  Invasive Species Council warns against weakening Australia’s biosecurity following tariffs \n  The Invasive Species Council has warned against weakening Australia’s biosecurity laws, saying this poses “just as big a threat” to the nation as Chinese warships. \n  In a statement, the interim CEO, Jack Gough, said: \n   \n   Biosecurity threats, from bird flu to fire ants, are just as big a threat to Australia’s national security as Chinese warships. It needs to be treated just as seriously. \n   Biosecurity is the first line of defense against extinctions and ecological destruction caused by new invaders. It is cheap compared to mopping up the mess if we let these things arrive. \n   \n  At his press conference earlier this morning, the prime minister, Anthony Albanese, said Australia had made it “very clear” to the United States “that we will not compromise on biosecurity.” \n   \n   We will not weaken the measures that protect our farmers and producers from the risks of disease or contamination. \n   \n  \n Updated at 1.36am BST \n \n \n  1.20am BST  \n  \n  Pauline Hanson’s daughter announces she will run for Senate \n  In some other political news this morning, Pauline Hanson’s daughter, Lee Hanson, has announced she will run for the Senate in Tasmania in the upcoming federal election. \n  She will run as part of her mother’s party, One Nation. Lee made the announcement on Sunrise earlier this morning. \n   \n   If you had asked me 10 years ago if I would be standing here right now, I would say absolutely not, no way! To your point, seeing what [Pauline has] been through, as a child witnessing your parent – the turmoils, ups and downs – why would you want to put yourself through that? \n   However, I’m a mum myself now. So I’m at a point where I feel I need to stand up. I care too much about my children’s future, so it’s time to make a change. \n   \n  Lee later said “my mother is polarising” and “I’m not gonna question that.” \n   \n   My mother is polarising. I’m not my mother, I’m very different … So yes, she is very different to me and I have some of the same values and strengths which I’m grateful for that she’s taught me, but I’m my own woman. \n   \n  Asked if she argues politically with her mother, Lee answered: \n   \n   I test her thinking and provide a different context from a next generation. \n   \n  \n Updated at 1.22am BST \n \n \n  1.14am BST  \n  \n  Map of the islands included in tariff regime \n  Here is the map of the islands that are included in the tariff regime from the United States. \n  Anthony Albanese spoke about the 29% tariff imposed on Norfolk Island earlier – if you missed his comments, you can read those here. \n   Interactive \n   \n    A map of the of the islands that are included in the tariff regime from the United States.\n    \n   \n  \n Updated at 1.17am BST \n \n \n  1.03am BST  \n  \n  The biggest exports Australia makes to the US \n  Let’s take a look at Australia’s biggest exports to the US amid the latest tariff announcements this morning. \n  Australian exports to the US totalled US$14.73bn in 2024, according to the UN’s Comtrade database on international trade. \n  The Top Ten exports to the US last year were (in US dollars): \n   \n   Meat and edible meat offal: $4.03bn \n   Pearls, precious stones, metals and coins: $2.02bn \n   Pharmaceutical products: $1.35bn \n   Optical, photo, technical and medical apparatus: $1.20bn \n   Machinery, nuclear reactors and boilers: $1.16bn \n   Electrical and electronic equipment: $686.78m \n   Aircraft and spacecraft: $663.41m \n   Animal, vegetable fats and oils, and cleavage products: $275.71m \n   Aluminium: $268.58m \n   Iron and steel: $265.75m \n   \n  \n Updated at 1.06am BST \n \n \n  12.54am BST  \n Summary of government's proposed response to Trump tariffs \n  \n  Let’s go back to the five-point plan the government has announced in response to the tariffs. Here are the points in a bit more detail: \n   \n   The government will give $5m to the anti-dumping commission to reduce case times, and better monitor goods and high-risk activities from overseas. There were concerns from industry that tariffs could lead to some countries “dumping” cheap stock into Australia. \n   There’s also $50m to help industries find new markets. \n   A new economic resilience program within the national reconstruction fund which will provide $1bn of zero interest loans to help industry access new markets. \n   Prioritise Australian firms in government procurement by requiring government to preference Australian businesses for procurement up to a threshold – including consideration of local content requirements for procurements above $1m. \n   Establish a critical minerals strategic reserve to underwrite critical mineral production and supply. \n   \n  \n Updated at 1.26am BST \n \n \n  12.27am BST  \n  \n  Albanese: Norfolk Island not a trade competitor with ‘giant economy’ of the US \n  The first question goes straight to tariffs. \n  As Dan Jervis-Bardy (who’s with the prime minister at this press conference) brought you earlier, it’s been confirmed there will not be a ban on Australian beef, but the industry will be hit with the 10% tariffs. \n  Albanese says he’s spoken to the national farmers federation and beef producers, to confirm the tariff impacts with them. \n   \n   All Australian supports are with them at this time and it is a really difficult period for them but it will be a 10% tariff. Brazil has the same so in terms of the competitive position, it is maintained. \n   \n  Of course the most shocking tariffs put in place are those on Norfolk Island … \n   \n   Norfolk Island has got a 29% tariff. I’m not quite sure that Norfolk Island, with respect to it, is a trade competitor with the giant economy of the United States but that just shows and exemplifies the fact that nowhere on earth is exempt from this. \n   \n  \n Updated at 1.08am BST \n \n \n  12.22am BST  \n  \n  Albanese announces new PBS listings \n  Off the back of Trump announcing tariffs on goods including pharmaceuticals, Albanese is announcing more medicines to be put on to the pharmaceutical benefits scheme. \n  Albanese says the new medicines include one listed to treat glioma, which occurs in the brain and spinal chord and is the most common cancer in the central nervous system in children. \n   \n   This is expected to support 130 Australian children and their families every year. Without this PBS subsidy, families could be up for up to $178,000 a year. As a result of this decision, when they come into pharmacies like this, the cost will be just $25 per prescription, making an enormous difference. \n   \n  The health minister, Mark Butler, says a medicine to help treat bone marrow cancer has also been added: \n   \n   1,900 patients a year who would otherwise be paying $70,000 on the private market for this life changing, life-saving treatment for this rare form of bone marrow cancer. \n   \n  \n Updated at 12.24am BST \n \n \n  12.17am BST  \n Stock market stumbles after Trump tariff announcement \n  \n  Investors are being “liberated” of billions of dollars, as sharemarkets begin to tumble after the unveiling of Trump’s sweep of new tariffs. \n  In early trade this morning, the benchmark ASX 200 index has dropped by 1.8% to 7794 points. \n  That follows US stock futures plunging by more than 3% as investors priced in the rising chance of a global trade war, Bloomberg is reporting. \n  Sticking with Wall Street, the likes of Nike, Gap and Lululemon cratered by more than 7% – a strong sign that the 10% blanket tariffs – and much larger imposts on Japan, the EU and, especially, China – will not do the global retailers any favours. \n  \n Updated at 1.19am BST \n \n \n  12.05am BST  \n  \n  The Greens leader, Adam Bandt, says Australia should “end Aukus” in response to Donald Trump’s latest tariffs. \n  In a series of posts to X (formerly Twitter), Bandt wrote: \n   \n   End Aukus. \n   Forget Trump’s ‘Liberation Day’, today should be Australia’s liberation day — when we finally liberate ourselves from being shackled too closely to Trump. \n   Trump is dangerous. It’s time for Labor &amp; Liberal to act. Let’s cancel AUKUS &amp; set our own independent foreign policy. \n   \n  \n Updated at 12.19am BST \n \n \n  12.03am BST  \n  \n  The press pack following Anthony Albanese is jetting out of Melbourne after the prime minister’s early morning press conference to respond to Donald Trump’s tariff strike. \n  We’ll let you know as soon as we land at our next destination.  \n  \n \n \n  11.59pm BST  \n  \n  Vic premier emphasises tariff impacts on working people, families and jobs.  \n  The Victorian premier, Jacinta Allan, has described tariffs imposed by the US on Australian exports as “entirely unjustifiable”. Speaking outside parliament this morning, she said: \n   \n   They’re unjustifiable, particularly when you consider the impact they are going to have on working people, not just around Victoria or Australia, but around the globe. These sorts of measures only put more pressure on working people, on their families and on their jobs. \n   \n  She says Victoria is the “food bowl of the nation” and was important to protect the state’s biosecurity: \n   \n   We are known internationally for our clean, green reputation for exporting to the world high-quality produce. So I strongly support the prime minister’s emphasis on ensuring those biosecurity arrangements remain strong. \n   \n  Allan also said she would continue to push local content requirements for Victorian transport projects and revealed she met with defence manufacturer Lockheed Martin last week to put the state’s businesses at the “front of the queue in the supply chain”. \n  \n Updated at 12.17am BST \n \n \n  11.54pm BST  \n  \n  Australia’s red meat industry will remain ‘strong’ despite tariffs, says advisory council  \n  The Red Meat Advisory Council (RMAC) says it’s “disappointed” of tariffs on red meat exports to the US, but noted there will be no ban on Australian red meat and that trade with the US will continue. \n  The council says the decision fails to recognise the industry’s contribution to US food supplies, but also pointed out how diverse the trade market is, particularly across Asia. \n  The RMAC Chair, John McKillop, says producers can be “assured” the industry will continue to operate in a “strong global trading environment”. \n   \n   It remains a disappointing decision from the US, in stark contrast to our 20-year partnership under the Australia-United States Free Trade Agreement … \n   Last year, 2024, was a record year for Australian red meat exports, driven by strong global demand. Australian producers can be assured that we operate in a strong global trading environment with high demand for our red meat from over 100 markets. \n   Major markets include Greater China, Japan and Korea, worth $3.9bn, $2.6bn and $2.5bn respectively. The Middle East / North Africa Market is worth A$2B and offers demand growth opportunities. \n   \n  \n Updated at 12.10am BST \n \n \n  11.49pm BST  \n  \n  ‘We already made concessions’ on beef, says Littleproud \n  Littleproud spells out some more of that risk that has previously led to a ban on US beef into Australia. \n  Albanese said earlier it started back in 2003 due to mad cow disease. \n  Littleproud says the current risk is around the supply chains that go beyond US borders: \n   \n   It’s their supply chain in the Americas, with particularly Canada and Mexico, that we can’t get certainty on, that gives us that confidence to allow that product to come in. But we already take frozen beef, we already made concessions. \n   \n  Littleproud also says Australia should reengage with partners within the trans-pacific partnership (CPTPP). \n  \n Updated at 12.03am BST \n \n \n  11.44pm BST  \n  \n  Littleproud blames PM’s ‘disparaging comments’ on Trump for tariffs on Australia \n  The Nationals leader and shadow agriculture minister, David Littleproud, says there’s “deep disappointment” over the tariffs, and that there’s a need for a “relationship reset”. \n  He’s putting some of the blame on the prime minister and government for having made disparaging comments of Trump in the past. \n   \n   What we need is a relationship reset. We’ve got a prime minister who can’t even get a phone call with the president. That’s because of the personal disparaging comments he made in the past. We need a reset to explain to President Trump, when you look at the tariffs he imposed on beef, he’s imposing that cost on his own people. \n   \n  Littleproud adds, specifically on beef, that Australia already takes US frozen beef, and that Australia shouldn’t reduce biosecurity standards to allow other beef imports from the US. \n  \n Updated at 12.26am BST \n \n \n  11.40pm BST  \n  \n  Dutton says some ABC journalists are ‘good’ while others are ‘partisan players’ \n  Dutton was also challenged on 2GB to name a journalist at the ABC who he thinks does “a good job”, as he leaves the door open to cutting the public broadcaster’s funding. \n  He initially skirts the question and says families and small businesses are struggling. \n   \n   Nobody at the ABC gets $1 of pay without you being funded by Australian taxpayers. And as I’ve said before, if we find waste in the ABC then we won’t support that, and Australian households and businesses would expect nothing less. \n   \n  Host Ben Fordham tries again – he mentions David Speers, Sarah Ferguson and Laura Tingle … Dutton answers that there are some “partisan players” within the organisation. \n   \n   I think there are some good journalists at the ABC, but I think there are some who you know, who, frankly, are just partisan players. And people see that on their TV screens every night. And again, the ABC is using taxpayers money, so use it wisely. \n   \n  \n Updated at 11.55pm BST \n \n \n  11.33pm BST  \n US will not ban Australian beef, Guardian Australia understands \n  \n  Breaking: Guardian Australia understands US officials have confirmed to Australia’s embassy in Washington that there will be no ban on Australian beef. \n  \n Updated at 11.49pm BST \n \n \n  11.31pm BST  \n  \n  Dutton says he’ll stand ‘shoulder-to-shoulder’ with PM on fighting tariffs \n  Let’s go back to Peter Dutton’s earlier interview on 2GB radio. Dutton says he’ll stand “shoulder-to-shoulder” with the government on rejecting the tariffs. \n  But he’s again positioning his party as stronger in standing up to a Trump administration. \n  (Meanwhile, Albanese’s and Wong’s language this morning has been that Australia needs to react calmly and respond in a careful and calibrated way.) \n  Dutton tells 2GB: \n   \n   I happy to stand shoulder-to-shoulder with the prime minister to make sure that we send a very clear message to the Americans that we don’t find it acceptable at all, and we are a trusted, reliable trading partner with the United States. \n   But we need to have a capacity to stand up and to negotiate and to arrive at the best possible outcome for our country. And that’s, I think, in part, what this election is about. \n   \n  \n Updated at 11.47pm BST \n \n \n  11.28pm BST  \n  \n  Albanese says Labor has navigated through ‘turbulent economic waters’ \n  ABC Radio Melbourne host Raf Epstein says Albanese has had a good first week on the campaign, but asks whether he had a bad last year (which he says press gallery journalists have been commenting). \n  Albanese says: “No.” \n   \n   No … we have been a determined government. We’ve governed in what have been turbulent economic times. \n   We have seen countries around the world with double digit inflation, some of them with double digit unemployment. At the same time across the ditch, New Zealand is in recession. What we have managed to do is negotiate our way through those turbulent economic waters. Keep our eye on the horizon. \n   \n  \n Updated at 11.43pm BST \n \n \n  11.22pm BST  \n  \n  Tariffs won’t affect Aukus agreement, Albanese says \n  Anthony Albanese says the tariffs won’t have an impact on the Aukus agreement between the US, UK and Australia. \n  He and others have said there is still great support across the political divide in the US for Aukus (and the US Virginia Class submarines that Australia would purchase in the 2030s would happen during a future administration, post-Trump). \n   \n   President Trump, who has said that he supports the Aukus arrangements, as do members of Congress, Senators across the political divide in the United States, both Democrat and Republican. \n   \n  A listener asks why Australia doesn’t pull out of Aukus and go back to the French for a submarine deal? Albanese says the government won’t do that because it’s not in Australia’s interests. \n   \n   We believe that Aukus is in the interests of defending our nation. We think it’s in Australia’s interest, and whilst we regard this [tariffs] as an act of self harm by the United States when it comes to their economy, what I’m not prepared to do is do anything that is in not in Australia’s interests. \n   \n  \n Updated at 11.39pm BST \n \n \n  11.18pm BST  \n  \n  PM says Norfolk Island hit with 29% tariff despite being an Australian territory \n  The PM is now on ABC Radio Melbourne, and is asked to clarify whether the action on beef is an all out ban or a tariff. \n  Albanese says his understanding is that it’s a tariff. \n   \n   We’ve been advised by their trade people that it’s a 10% tariff. \n   I’ve indicated very clearly in the discussions that I’ve had with President Trump that we regard tariffs as not being in the interests of the United States. \n   \n  It seems that while the government did expect these new tariffs, it was somewhat taken aback by other tariffs for Norfolk Island, which is an Australian territory. \n  Albanese says: \n   \n   I think Norfolk Island somehow has been hit with 29% tariff rather than 10%. Last time I looked, Norfolk Island was a part of Australia. \n   \n  \n Updated at 11.37pm BST \n \n \n  11.03pm BST  \n  \n  Where does the 10% number come from? \n  Anthony Albanese says the 10% figure was a political decision and rather than an economic decision. \n   \n   They have made a decision that there will be a 10% tariff minimum from every nation. That’s a political decision. This is not an economic decision.  \n   \n  He says the government is still seeking clarification on all the decisions, including on beef, which Albanese says has been discussed with the administration (though again he has stressed there will be no compromise on bio-security laws). \n  Back to his meeting with Greg Norman, Albanese won’t say what advice Norman gave him, but that Norman and others will support their efforts to engage in the US. \n   \n   He’s [Norman is] someone with connections with the US administration, and we are engaging with Australians who have connections with the United States to advance our national interests. \n   \n  \n Updated at 11.13pm BST \n \n \n  10.55pm BST  \n Albanese says government using ‘every asset’ available in talks with US \n  \n  Anthony Albanese’s provided a bit more detail on the conversations that the government has had with the US administration over the last few days before the announcement. \n  He said earlier that this decision from Donald Trump was expected, and discussions have been ongoing. \n   \n   There’s been a series of written to and fro, if you like. There’s been negotiations with Mr [Howard] Ludnick [the commerce secretary] and with others in the United States as well. So this came as no surprise to us. \n   We had prepared for a period of time the response, a five point response that you will you announced this morning. We met as leaders last night, and again, had contact this morning with obviously, the relevant ministers, as well as our economic ministers. \n   \n  Albanese won’t specifically say when his government was told Australia would be hit with tariffs, just that “we were very clear about where this was headed”. \n  He adds the government is using “every asset” available, and mentions his dinner with Greg Norman last night. \n  \n Updated at 11.09pm BST \n \n \n  10.49pm BST  \n Farrell vows to get free trade agreement with EU: ‘The world has changed for Europe’ \n  \n  Don Farrell says he believes the EU will come back to Australia with a better deal because the world has changed today and the EU has been hit even harder than Australia on its exports. \n  The trade minister says beef was one of the sticking points between the two regions: \n   \n   The agreement with the European Union did fall over, over beef imports into the EU. The world has changed. As of today, the world has changed for Europe. \n   Europe has now [been] set back to a much higher tariff into the United States. If they’re sensible, if they’re sensible, they will make us a better offer on the issues that made the agreement fall over last time, and we will get a free trade agreement with the with the EU, the largest economy in the world. \n   \n  \n Updated at 10.58pm BST \n \n \n  10.44pm BST  \n Albanese says ‘no one has got a better deal’ than Australia in Trump's tariff regime \n  \n  Anthony Albanese emphasises that “no one has got a better deal” than Australia, and diplomats and officials are continuing to engage with the administration: \n   \n   We have made very strong representations. Ministers, our ambassador, people in the embassy, people at departmental level, we’ve used every asset at our disposal. \n   But what it does mean - it’s a bit like what I was saying yesterday. Steel and aluminium, there’s not more steel and aluminium being produced in the United States today than there was in February. \n   \n  The PM says that his understanding is that these 10% tariffs will be across the board. \n   \n   Australia and the United Kingdom were in negotiations, I’m not sure about other countries, but I know that we were and that was under consideration … So our understanding is that it applies across the board. \n   \n  He says again the best response is to buy Australian, and Labor will continue to promote Australian products (like Bundaberg ginger beer which he says he had at the Bundaberg factory when he was up campaigning in Queensland earlier this week). \n  \n Updated at 11.34pm BST \n \n \n  10.39pm BST  \n Farrell to meet with European counterparts to discuss FTA \n  \n  The trade minister, Don Farrell, says Australia will continue to engage with the US administration to remove the “unfair” tariffs. \n  He reiterates the calm approach, saying it will be by negotiation, by “sitting down and explaining to people the issues at hand” that will best present Australia’s case. \n  Farrell has also revealed he’s meeting again with he’s European counterparts to re-discuss a free trade agreement with the EU (previous negotiations got stuck on issues like naming rights for products including feta and prosecco). \n   \n   On that Monday afternoon, I’m talking with my European counterpart, we all know what happened the last time we had discussions with the Europeans, I think things have changed. And the opportunity to have further negotiations about a free trade agreement on better terms than have been previously offered now exists. \n   \n  \n Updated at 10.53pm BST \n \n \n  10.36pm BST  \n  \n  Wong says countries in Asia-Pacific region hit hard by tariffs \n  Penny Wong stands up next and says the decision from the US underlines the current state of global uncertainty. \n  Wong goes further in outlining how Australia is diversifying its trade, and will continue to focus on trade in our region, and across South-East Asia. The foreign minister says: \n   \n   Some of the countries in our region are the hardest hit by the tariffs.  \n   But we face those challenges calmly and maturely. We certainly won’t be picking fights in our neighbourhood. Our approach is to be credible and mature. \n   \n  Yesterday Peter Dutton said he would be prepared to fight with the US administration over these tariffs. \n  So we’re getting a clearer divide in approach between the two major parties – Labor emphasising a calm and methodical approach, while the Coalition is going more aggressive, and trying to pin that calm approach as “weak” (which we heard again from Dutton this morning). \n  \n Updated at 10.52pm BST \n \n \n  10.31pm BST  \n Albanese announces funding to help exporters move into new markets \n  \n  In response to the tariffs, and concerns on the global impacts, Albanese says the government will tighten anti-dumping measures to safeguard the aluminium and steel industry (hit by the first round of tariffs). \n  He’s also announced $50m to help the agricultural and other sectors to move their products into new markets. \n  There will also be a new critical minerals strategic reserve – but the PM says more details on that will be revealed later. \n   \n   We will establish a new economic resilience program through our National Reconstruction Fund. This will provide $1 billion in zero-interest loans for firms to capitalise on new export opportunities… \n   Just as we are already encouraging more people to buy Australian, our Labor government will buy Australian, too. This comes on the back of the announcements that I made in Port Kembla, for example, about procurement of Australian steel. \n   \n  Albanese says Australian businesses will get priority, and sit at the front of the queue for government procurement. \n  \n Updated at 11.01pm BST \n \n \n  10.28pm BST  \n  \n  Albanese: ‘This will have consequences for how Australians see this relationship’ \n  Anthony Albanese says the government will stand up for Australia’s interests. \n  Interestingly, the PM says the action will have “consequences for how Australians see this relationship” between the US and Australia. \n   \n   The Australian people have every right to view this action by the Trump administration as undermining our free and fair trading relationship and counter to the shared values that have always been at the heart of our two nations’ longstanding friendship. This will have consequences for how Australians see this relationship. \n   \n  Albanese says again there’ll be no compromise on the Pharmaceutical Benefits Scheme or agriculture. \n   \n   We’ll never trade away the things which make us the best country in the world. The Pharmaceutical Benefits Scheme is an Australian institution. A proud Labor creation that my government has built on. \n   We have made it very clear to the United States that we will not compromise on biosecurity. We will not weaken the measures that protect our farmers and producers from the risks of disease or contamination. \n   \n  \n Updated at 10.37pm BST \n \n \n  10.24pm BST  \n Albanese says 'this is not the act of a friend' after Trump announcement \n  \n  Anthony Albanese says the latest action from the Trump administration has not come as a surprise, and the tariffs are “not unexpected”. \n  But he repeats the line that the tariffs are unwarranted: \n   \n   President Trump referred to reciprocal tariffs. A reciprocal tariff would be zero, not 10%. The administration’s tariffs have no basis in logic and they go against the basis of our two nations’ partnership. This is not the act of a friend. \n   \n  \n Updated at 11.04pm BST \n \n \n  10.23pm BST  \n Peter Dutton: ‘We need to stand up for our country’s interests’ \n  \n  Just before the PM stands up, the opposition leader, Peter Dutton, is reacting to Trump’s announcement, speaking to 2GB radio. \n  Dutton says Trump’s put forward a negotiating position, but says there’s been “no significant negotiation” between US and Australian leaders, as Albanese hasn’t been able to get Trump on the phone for a third call. \n   \n   So there has been the significant failing, and we need to be strong and to stand up for our country’s interests. \n   \n  Dutton is going in hard saying, saying “we need to stand up for our country’s interests”. \n   \n   Donald Trump doesn’t have any time for [ambassador] Kevin Rudd, and we know that Anthony Albanese is on the record saying all sorts of colourful things about the president. Well, it’s obviously a dysfunctional relationship, and we need to make sure that we stand up for our country’s interests, and the prime minister, as I say, can’t get a phone call, can’t get a meeting, and I hope that that happens soon, because it’s in our country’s best interest. \n   \n  \n Updated at 10.27pm BST \n \n \n  10.16pm BST  \n  \n  The prime minister, Anthony Albanese, the foreign minister, Penny Wong, and the trade minister, Don Farrell, will respond to Trump’s tariffs at 8.20am. Stay tuned.  \n  \n \n \n  10.14pm BST  \n  \n  Liberal senator James Paterson: ‘Just hoping for an exemption is not a plan’ \n  The shadow home affairs minister and Liberal campaign spokesperson James Paterson says Australia needs to “establish the facts” after Trump’s liberation day announcement. \n  Australia will be subject to a minimum 10% tariff, but the announcement was scant on details. \n  Paterson tells Sky News: \n   \n   We know at the very least that we’re going to be subject to a 10% tariff, but we don’t have any other specific actions about any other industries or sectors in Australia. \n   \n  Paterson won’t rule in or out whether Australia should take action to the World Trade Organisation. He also says the PM should be speaking to Trump face to face. \n   \n   I think the most important thing is the direct relationship that we have and are able to build on with the President and with our other friends in the United States. And I do think it would exist in achieving that for having direct face to face talks between the Australian Prime Minister and the American president. \n   Just hoping for an exemption is not a plan, and just leaving this to officials is not adequate. And I think we do need strong leadership to deal with this. \n   \n  The PM met with Greg Norman overnight, who has a close relationship with Trump. \n  \n Updated at 10.18pm BST \n \n \n  9.46pm BST  \n  \n  Albanese to respond to Trump’s tariff announcement \n  The press pack following Anthony Albanese has arrived at the Commonwealth Parliamentary Offices (CPO) in Melbourne’s CBD, where the prime minister will soon respond to Trump’s tariffs announcement. \n  \n Updated at 9.51pm BST \n \n \n  9.42pm BST  \n Australia to be hit with 10% reciprocal tariff from US, chart shows \n  \n  We have seen the full chart that Donald Trump was holding earlier. \n  Trump mentioned there would be a minimum 10% reciprocal tariff, and according to that full chart, Australia will incur the 10% reciprocal tariff. \n  Anthony Albanese is due to speak soon this morning, and will respond to Trump’s announcement. \n  This week he said there would be no negotiations with the US over changing the PBS, bio-security laws or the news bargaining agreement. \n  \n Updated at 10.09pm BST \n \n \n  9.38pm BST  \n  \n  Trump has moved on to the possibility of exemptions … \n  In Trump’s first administration, Australia secured exemptions from tariffs after arguing that Australia ran a trade deficit with America, had a signed and ratified free trade agreement, and was a committed ally and security partner. \n  But Trump’s second administration has repeatedly said the president regrets the exemptions he gave to Australia in his first term, particularly for the precedent they set for other countries claiming similar carve-outs. \n  He said this morning: \n   \n   To all of the foreign presidents, prime ministers, kings, queens, ambassadors, and everyone else, who will soon be calling to ask for exemptions from these tariffs, I say: terminate your own tariffs, drop your barriers, don’t manipulate your currencies … and start buying tens of billions of dollars of American goods. \n   \n  \n Updated at 9.53pm BST \n \n \n  9.33pm BST  \n  \n  Trump says tariffs to be placed on pharmaceuticals \n  Trump says he’ll be putting in place reciprocal tariffs on pharmaceuticals, at half the rate “they have been charging us”. \n  Trump calls it a discounted reciprocal tariff, rather than a “full reciprocal” which he says would have been “tough” for a lot of countries. \n  He’s got a print out chart and is going down a list of individual tariffs for countries including China, Vietnam, the UK, Switzerland and more. \n  Australia hasn’t been mentioned down the list (he didn’t read the whole thing) but Trump says there will be a minimum reciprocal tariff of 10%. \n  \n Updated at 9.37pm BST \n \n \n  9.21pm BST  \n Trump confirms Australian beef on tariff menu \n  \n  Australia has gotten its first mention – Trump says Australia has banned American beef, but the US imports $3bn of Australian beef. \n  The ban on US beef was imposed in 2003 after America cases of bovine spongiform encephalopathy (mad cow disease). \n  He hasn’t yet said what penalty will apply: \n   \n   Australia … they’re wonderful people, and wonderful everything, but they ban American beef. Yet we imported $3bn of Australian beef from them just last year alone. They won’t take any of our beef. They don’t want it because they don’t want it to affect their farmers and, you know, I don’t blame them but we’re doing the same thing, right now starting at midnight tonight, I would say. \n   \n  Beef is a significant Australian export to America – Australian lean beef is added to fatty American meat to make hamburgers. \n  \n Updated at 12.33am BST \n \n \n  9.10pm BST  \n Trump hails ‘the day America’s destiny was reclaimed’ in tariff announcement \n  \n  Donald Trump has stepped into the rose garden at the White House and declared “liberation day” will make America wealthy again. \n  The US president is announcing reciprocal tariffs. “That means they do it to us and we do it to them. Simple.” \n   \n   April 2, 2025, will forever be remembered as the day American industry was reborn, the day America’s destiny was reclaimed, and the day that we began to make America wealthy again. \n   For decades our country has been looted, pillaged, raped and plundered by nations near and far, both friend and foe alike. \n   \n  Trump claims the tariffs will bring jobs and factories back to the US. \n   \n   This will be indeed the golden age of America. \n   \n  You can follow our US politics blog here for all the updates from Trump’s announcement. \n  \n Updated at 9.40pm BST \n \n \n  9.04pm BST  \n Labor's 'same job, same pay' laws will deliver $920m pay rise for workers, study says \n  \n  The Albanese government’s “same job, same pay” laws will deliver a combined $920m annual pay rise for workers, according to new analysis that Labor will use to warn of the risks to wages if Peter Dutton rolls back the regime. \n  Laws came into force last year allowing labour-hire workers to apply to be paid the same amount as directly employed staff doing the same job. \n  Unions are already using the bargaining tool, with hundreds of Qantas flight attendants set to receive pay rises of up to $20,000 per year after the airline reached an agreement with the Flight Attendants’ Association of Australia. \n  A new report from progressive think tank the McKell Institute estimated the new system would deliver a wages boost of up to $920.3m each year to workers in industries such as mining, aviation and retail. \n  The McKell Institute chief executive, Edward Kavanough, said: \n   \n   The data tells a clear story: the wage gains are real, they’re substantial, and they’re being delivered without any adverse impact on jobs or economic performance. \n   \n  The Coalition has promised to review the legislation as part of a wider rolling back of Labor’s industrial relations agenda, which includes a promise to abolish the so-called “right to disconnect”. \n  The workplace relations minister, Murray Watt, claimed Dutton would scrap the laws in act of “pure arrogance”. \n   \n   This would rip billions of dollars out of workers’ pay packets and the wider economy, particularly in regional Australia. \n   \n  \n \n \n  8.59pm BST  \n  \n  Good morning, \n  Krishani Dhanji here with you, thanks to Martin Farrer for getting us started this morning. \n  All eyes will be on the White House in a matter of moments, as Donald Trump unveils his latest, more wide-ranging set of tariffs. \n  There’ll be plenty of reaction to it here and overseas throughout the day, and you’ll no doubt see both Anthony Albanese and Peter Dutton try to shape the issue to their advantage. \n  Buckle up, it’s going to be a big one! \n  \n Updated at 9.27pm BST \n \n \n  8.56pm BST  \n John Howard says 'history is against' Coalition in election \n  \n  Former Liberal prime minister John Howard has labelled the Coalition as the underdog in the federal election, but said a volatile electorate and Anthony Albanese being “out of his depth” could hamper Labor. \n  Howard, speaking to Sky News’ Chris Kenny on Wednesday night, said “history was against” the Coalition winning the election, pointing out there hadn’t been a one-term government in Australia since 1931. \n  Howard said: \n   \n   The electorate is more volatile, but you can’t ignore history. I’d have thought six months ago if we’d have had this conversation, I’d have thought the Coalition had no hope of winning simply because of history, but in the last six months, I think Peter Dutton has done a fantastic job. \n   The description I would make of the prime minister (Albanese) is that he’s out of his depth. Now, I as a Liberal leader, I disagreed with Labor leaders a lot. I disagreed with Bob Hawke a lot, but I never thought Hawke was out of his depth, I just thought he was wrong. \n   I disagreed even more with Paul Keating, who I thought was inferior to Hawke as a prime minister, but you could never say he was out of his depth depth, whereas I don’t think Anthony Albanese quite knows what’s happening around him, particularly when it comes to Chinese ships, he doesn’t seem to have a clue. \n   \n  Howard also backed the Coalition’s proposed fuel excise cut over Labor’s tax cuts unveiled at last week’s budget, arguing the immediacy of impact of the excise cut will better address cost of living challenges. \n  The former PM also predicted that it would be harder than expected for teal MPs to retain their seats. He said: \n   \n   I think a lot of people who voted for the teals did so because they were grumpy for one or another reason with the Liberals. I don’t think that’s the case now. I think they like Dutton. \n   I think they see in Dutton an unexpectedly strong, serious leader. He’s a serious player, and he gives the impression of somebody who’s been around. He’s not full of himself and does understand the good and the bad in society. \n   \n  \n Updated at 9.22pm BST \n \n \n  8.52pm BST  \n  \n  Peter Dutton to WA visit to promise road funding to support mining \n  Peter Dutton is in Western Australia for his first visit to the mining state of this campaign, and has come bearing a $600m announcement for roads which are critical to mining and agriculture. \n  He will spend the day in WA and Perth, before it’s expected he’ll return to the east coast late tonight or early tomorrow. \n  The infrastructure pledge would be spent nationwide, but announcing the money in WA is intentional. In a statement, Dutton said “We appreciate the contribution that Western Australia in particular makes to Australia through the mining, resources and agricultural sectors.” \n  “We know that WA’s exports help pay for the nation’s roads, hospitals and schools,” he said. \n  The big money promise would, according to the Liberal leader, “support our mining, resources and farming sectors by investing in infrastructure to upgrade agricultural and mining roads critical to getting product to domestic and export markets.” \n  “The Coalition will work with representatives of the trucking, farming and mining industries to identify the priority roads to be upgraded in each state to remove barriers to the growth of our resources and farming sectors.” \n  The money would come over four years, and go toward sealing, widening and strengthening roads and bridges, as well as flood resilience upgrades. \n  “I want Western Australia to continue to be the powerhouse of the national economy. But we need a government in Canberra that plays to WA’s strengths, not works against it,” Dutton said. \n  \n Updated at 9.14pm BST \n \n \n  8.45pm BST  \n Liberal candidate for Kooyong skips community forum to hit phones with Angus Taylor \n  \n  The Liberal candidate for Kooyong, Amelia Hamer, skipped a community forum dedicated to questions on climate policy on Wednesday night, opting instead to hit the phones with Angus Taylor. Text messages seen by Guardian Australia show Hamer was planning to hold a telephone conference call with Kooyong voters alongside the shadow treasurer, Angus Taylor, at 7:30pm. The community forum began at the same time. \n  This text message from “VIC LIBERAL” was sent to Kooyong residents at 7:15pm: “Amelia Hamer here. I’ll give you a call at 7:30 tonight. It’s your chance to quiz me and the shadow treasurer about our plan to get Australia Back on Track.” \n  Organisers of the Kooyong Community Forum, Lighter Footprints, told the audience that Hamer was a last minute cancellation and that as a result she would be represented by an empty chair: \n   \n   All candidates were made aware that if they were not coming tonight then they would be represented by an empty chair. This notice was given in advance. \n   \n  Lighter Footprints describes itself as “a local climate group committed to leading effective climate action”. The group described the event as a chance to “find out where the candidates stand on climate”.In Hamer’s place, the organisers asked a member of the Kooyong Climate Alliance, Alex Currell, to give an assessment of the Liberal’s environmental policies: \n   \n   The Liberals have failed to announce a 2030 or 2035 emissions target, committing only to net zero by 2050. The fate of the climate will be determined by cumulative emissions, so this lack of short or medium term targets is deeply problematic. \n   \n  The event’s presenter thanked Currell for “stepping in last minute”. \n  \n Updated at 9.12pm BST \n \n \n  8.38pm BST  \n PM dines with Greg Norman on eve of Trump's tariff announcement \n  \n  Anthony Albanese has revealed on social media that he met up with Greg Norman last night. \n  “Great to catch up with Greg Norman tonight in Melbourne,” the PM wrote on Instagram, with a pic of the pair in white tops. \n  They reportedly had dinner together. \n           View this post on Instagram            A post shared by Anthony Albanese (@albomp)\"> \n   \n    Social media post from Anthony Albanese shows the PM with golfing great Greg Norman.\n    \n   \n  It’s interesting timing, coming just hours before Donald Trump’s tariffs were due to be announced. \n  Norman has previously been called on to act as a diplomatic bridge to the US administration, thanks to his occasional golf games with the president. \n  He reportedly helped connect then-PM Malcolm Turnbull and the president before Australia secured a tariff exemption. \n  Earlier this year Norman told the Australian Financial Review that he had played golf with Trump just before the recent election, and Trump had promised to give him US citizenship. \n  Albanese was also reported to have had a “missed call” from Norman on Sunday morning, \n  \n Updated at 9.26pm BST \n \n \n  8.29pm BST  \n Welcome \n  \n  Good morning and welcome to our live election coverage. I’m Martin Farrer with the best of the overnight stories to get us into gear before Krishani Dhanji takes the wheel. \n  Former Liberal prime minister John Howard says Peter Dutton is the underdog in the federal election and that history favours Anthony Albanese because there hasn’t been a one-term government since 1931. Speaking on Sky News last night, Howard said Dutton is taking the fight to Labor but he was up against it. However, he said “a volatile electorate” made things difficult to predict and he condemned Anthony Albanese as being “out of his depth”. More coming up. \n  Dutton will continue his “underdog” fight when he takes his campaign to Western Australia for the first time today. He will announce a plan to spend $600m on roads across the country, hoping that the promise of federal spending on infrastructure will appeal to voters in a state where transport links are crucial for the dominant mining and agriculture sectors. \n  Anthony Albanese will be anxious to show he is not out of his depth and that he can stand up to Donald Trump if the US president’s tariffs hit the Australian economy. There is concern that Trump’s expected levies will hurt Australian pharmaceuticals, meat and metals among other things, and Albanese yesterday did not rule out the possibility of countering the tariffs by taking a case to the World Trade Organisation. \n  The PM revealed on social media that he dined with golfer Greg Norman last night. It’s interesting timing, as Australia braces for Trump’s “liberation day” tariffs. \n  We’ll have all the political and market reaction to those tariffs as it happens. \n  \n Updated at 8.36pm BST \n"}